zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_mdma.h
/** @defgroup MDMA_LL_EC_SRC_INC_OFFSET_SIZE Source Increment Offset Size
  * @{
  */
#define LL_MDMA_SRC_INC_OFFSET_BYTE        0x00000000U                           /*!< offset is Byte (8-bit)         */
#define LL_MDMA_SRC_INC_OFFSET_HALFWORD    MDMA_CTCR_SINCOS_0                    /*!< offset is Half Word (16-bit)   */
#define LL_MDMA_SRC_INC_OFFSET_WORD        MDMA_CTCR_SINCOS_1                    /*!< offset is Word (32-bit)        */
#define LL_MDMA_SRC_INC_OFFSET_DOUBLEWORD  MDMA_CTCR_SINCOS                      /*!< offset is Double Word (64-bit) */
/**
  * @}
  */

/** @defgroup MDMA_LL_EC_DEST_DATA_SIZE Destination Data Size
  * @{
  */
#define LL_MDMA_DEST_DATA_SIZE_BYTE       0x00000000U                            /*!< Destination data size is Byte        */
#define LL_MDMA_DEST_DATA_SIZE_HALFWORD   MDMA_CTCR_DSIZE_0                      /*!< Destination data size is half word   */
#define LL_MDMA_DEST_DATA_SIZE_WORD       MDMA_CTCR_DSIZE_1                      /*!< Destination data size is word        */
#define LL_MDMA_DEST_DATA_SIZE_DOUBLEWORD MDMA_CTCR_DSIZE                        /*!< Destination data size is double word */
/**
  * @}
  */

/** @defgroup MDMA_LL_EC_SRC_DATA_SIZE Source Data Size
  * @{
  */
#define LL_MDMA_SRC_DATA_SIZE_BYTE       0x00000000U                            /*!< Source data size is Byte        */
#define LL_MDMA_SRC_DATA_SIZE_HALFWORD   MDMA_CTCR_SSIZE_0                      /*!< Source data size is half word   */
#define LL_MDMA_SRC_DATA_SIZE_WORD       MDMA_CTCR_SSIZE_1                      /*!< Source data size is word        */
#define LL_MDMA_SRC_DATA_SIZE_DOUBLEWORD MDMA_CTCR_SSIZE                        /*!< Source data size is double word */
/**
  * @}
  */

/** @defgroup MDMA_LL_EC_DEST_INC_MODE Destination Increment Mode
  * @{
  */
#define LL_MDMA_DEST_FIXED               0x00000000U                            /*!< Destination address pointer is fixed */
#define LL_MDMA_DEST_INCREMENT           MDMA_CTCR_DINC_1                       /*!< Destination address pointer is incremented after each data transfer */
#define LL_MDMA_DEST_DECREMENT           MDMA_CTCR_DINC                         /*!< Destination address pointer is decremented after each data transfer */
/**
  * @}
  */

/** @defgroup MDMA_LL_EC_SRC_INC_MODE Source Increment Mode
  * @{
  */
#define LL_MDMA_SRC_FIXED                0x00000000U                            /*!< Destination address pointer is fixed */
#define LL_MDMA_SRC_INCREMENT            MDMA_CTCR_SINC_1                       /*!< Destination address pointer is incremented after each data transfer */
#define LL_MDMA_SRC_DECREMENT            MDMA_CTCR_SINC                         /*!< Destination address pointer is decremented after each data transfer */
/**
  * @}
  */

/** @defgroup MDMA_LL_EC_BLK_RPT_DEST_ADDR_UPDATE_MODE Block Repeat Destination address Update Mode
  * @{
  */
#define LL_MDMA_BLK_RPT_DEST_ADDR_INCREMENT   0x00000000U                       /*!< Destination address pointer is incremented after each block transfer by Destination Update Value */
#define LL_MDMA_BLK_RPT_DEST_ADDR_DECREMENT   MDMA_CBNDTR_BRDUM                 /*!< Destination address pointer is decremented after each block transfer by Destination Update Value */
/**
  * @}
  */

/** @defgroup MDMA_LL_EC_SRC_BLK_RPT_ADDR_UPDATE_MODE Source Block Repeat address Update Mode
  * @{
  */
#define LL_MDMA_BLK_RPT_SRC_ADDR_INCREMENT   0x00000000U                        /*!< Source address pointer is incremented after each block transfer by Source Update Value */
#define LL_MDMA_BLK_RPT_SRC_ADDR_DECREMENT   MDMA_CBNDTR_BRSUM                  /*!< Source address pointer is decremented after each block transfer by Source Update Value */
/**
  * @}
  */

/** @defgroup MDMA_LL_EC_DEST_BUS Destination BUS Selection
  * @{
  */
#define  LL_MDMA_DEST_BUS_SYSTEM_AXI    0x00000000U                             /*!< System/AXI bus is used as destination */
#define  LL_MDMA_DEST_BUS_AHB_TCM       MDMA_CTBR_DBUS                          /*!< AHB bus/TCM is used as destination    */
/**
  * @}
  */

/** @defgroup MDMA_LL_EC_SRC_BUS Source BUS Selection
  * @{
  */
#define LL_MDMA_SRC_BUS_SYSTEM_AXI     0x00000000U                             /*!< System/AXI bus is used as source */
#define LL_MDMA_SRC_BUS_AHB_TCM        MDMA_CTBR_SBUS                          /*!< AHB bus/TCM is used as source    */
/**
  * @}
  */

/** @defgroup MDMA_LL_EC_HW_TRIGGER_SELCTION HW Trigger Selection
  * @{
  */
#define LL_MDMA_REQ_DMA1_STREAM0_TC          0x00000000U    /*!< MDMA HW Trigger (request) is DMA1 Stream 0 Transfer Complete Flag   */
#define LL_MDMA_REQ_DMA1_STREAM1_TC          0x00000001U    /*!< MDMA HW Trigger (request) is DMA1 Stream 1 Transfer Complete Flag   */
#define LL_MDMA_REQ_DMA1_STREAM2_TC          0x00000002U    /*!< MDMA HW Trigger (request) is DMA1 Stream 2 Transfer Complete Flag   */
#define LL_MDMA_REQ_DMA1_STREAM3_TC          0x00000003U    /*!< MDMA HW Trigger (request) is DMA1 Stream 3 Transfer Complete Flag   */
#define LL_MDMA_REQ_DMA1_STREAM4_TC          0x00000004U    /*!< MDMA HW Trigger (request) is DMA1 Stream 4 Transfer Complete Flag   */
#define LL_MDMA_REQ_DMA1_STREAM5_TC          0x00000005U    /*!< MDMA HW Trigger (request) is DMA1 Stream 5 Transfer Complete Flag   */
#define LL_MDMA_REQ_DMA1_STREAM6_TC          0x00000006U    /*!< MDMA HW Trigger (request) is DMA1 Stream 6 Transfer Complete Flag   */
#define LL_MDMA_REQ_DMA1_STREAM7_TC          0x00000007U    /*!< MDMA HW Trigger (request) is DMA1 Stream 7 Transfer Complete Flag   */
#define LL_MDMA_REQ_DMA2_STREAM0_TC          0x00000008U    /*!< MDMA HW Trigger (request) is DMA2 Stream 0 Transfer Complete Flag   */
#define LL_MDMA_REQ_DMA2_STREAM1_TC          0x00000009U    /*!< MDMA HW Trigger (request) is DMA2 Stream 1 Transfer Complete Flag   */
#define LL_MDMA_REQ_DMA2_STREAM2_TC          0x0000000AU    /*!< MDMA HW Trigger (request) is DMA2 Stream 2 Transfer Complete Flag   */
#define LL_MDMA_REQ_DMA2_STREAM3_TC          0x0000000BU    /*!< MDMA HW Trigger (request) is DMA2 Stream 3 Transfer Complete Flag   */
#define LL_MDMA_REQ_DMA2_STREAM4_TC          0x0000000CU    /*!< MDMA HW Trigger (request) is DMA2 Stream 4 Transfer Complete Flag   */
#define LL_MDMA_REQ_DMA2_STREAM5_TC          0x0000000DU    /*!< MDMA HW Trigger (request) is DMA2 Stream 5 Transfer Complete Flag   */
#define LL_MDMA_REQ_DMA2_STREAM6_TC          0x0000000EU    /*!< MDMA HW Trigger (request) is DMA2 Stream 6 Transfer Complete Flag   */
#define LL_MDMA_REQ_DMA2_STREAM7_TC          0x0000000FU    /*!< MDMA HW Trigger (request) is DMA2 Stream 7 Transfer Complete Flag   */
#define LL_MDMA_REQ_DMA3_STREAM0_TC          0x00000010U    /*!< MDMA HW Trigger (request) is DMA3 Stream 0 Transfer Complete Flag   */
#define LL_MDMA_REQ_DMA3_STREAM1_TC          0x00000011U    /*!< MDMA HW Trigger (request) is DMA3 Stream 1 Transfer Complete Flag   */
#define LL_MDMA_REQ_DMA3_STREAM2_TC          0x00000012U    /*!< MDMA HW Trigger (request) is DMA3 Stream 2 Transfer Complete Flag   */
#define LL_MDMA_REQ_DMA3_STREAM3_TC          0x00000013U    /*!< MDMA HW Trigger (request) is DMA3 Stream 3 Transfer Complete Flag   */
#define LL_MDMA_REQ_DMA3_STREAM4_TC          0x00000014U    /*!< MDMA HW Trigger (request) is DMA3 Stream 4 Transfer Complete Flag   */
#define LL_MDMA_REQ_DMA3_STREAM5_TC          0x00000015U    /*!< MDMA HW Trigger (request) is DMA3 Stream 5 Transfer Complete Flag   */
#define LL_MDMA_REQ_DMA3_STREAM6_TC          0x00000016U    /*!< MDMA HW Trigger (request) is DMA3 Stream 6 Transfer Complete Flag   */
#define LL_MDMA_REQ_DMA3_STREAM7_TC          0x00000017U    /*!< MDMA HW Trigger (request) is DMA3 Stream 7 Transfer Complete Flag   */
#define LL_MDMA_REQ_FMC_DATA                 0x00000018U    /*!< MDMA HW Trigger (request) is NAND data transfer (Tx or Rx) channel  */
#define LL_MDMA_REQ_FMC_ERROR                0x00000019U    /*!< MDMA HW Trigger (request) is NAND ECC/BCH Error channel             */
#define LL_MDMA_REQ_QUADSPI_FIFO_TH          0x0000001AU    /*!< MDMA HW Trigger (request) is QSPI FIFO threshold Flag               */
#define LL_MDMA_REQ_QUADSPI_TC               0x0000001BU    /*!< MDMA HW Trigger (request) is QSPI Transfer complete Flag            */
#define LL_MDMA_REQ_CRYP1_IN                 0x0000001CU    /*!< MDMA HW Trigger (request) is CRYP1 4 word request from input        */
#define LL_MDMA_REQ_CRYP1_OUT                0x0000001DU    /*!< MDMA HW Trigger (request) is CRYP1 4 word request from output       */
#define LL_MDMA_REQ_HASH1_IN                 0x0000001EU    /*!< MDMA HW Trigger (request) is HASH1 16 word request from input       */
#define LL_MDMA_REQ_SAES_IN                  0x0000001FU    /*!< MDMA HW Trigger (request) is SAES request from input        */
#define LL_MDMA_REQ_SAES_OUT                 0x00000020U    /*!< MDMA HW Trigger (request) is SAES request from output       */
#define LL_MDMA_REQ_SW                       0x40000000U    /*!< MDMA SW Trigger (request)   */
/**
  * @}
  */

/** @defgroup MDMA_LL_EC_XFER_ERROR_DIRECTION Transfer Error Direction
  * @{
  */
#define LL_MDMA_READ_ERROR                       0x00000000U                /*!< Last transfer error on the channel was a related to a read access    */
#define LL_MDMA_WRITE_ERROR                      MDMA_CESR_TED              /*!< Last transfer error on the channel was a related to a write access   */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup MDMA_LL_Exported_Macros MDMA Exported Macros
  * @{
  */

/** @defgroup MDMA_LL_EM_WRITE_READ Common Write and read registers macros
  * @{
  */
/**
  * @brief  Write a value in MDMA register
  * @param  __INSTANCE__ MDMA Instance
  * @param  __REG__ Register to be written
  * @param  __VALUE__ Value to be written in the register
  * @retval None
  */
#define LL_MDMA_WriteReg(__INSTANCE__, __REG__, __VALUE__) WRITE_REG((__INSTANCE__)->__REG__, (__VALUE__))

/**
  * @brief  Read a value in MDMA register
  * @param  __INSTANCE__ MDMA Instance
  * @param  __REG__ Register to be read
  * @retval Register value
  */
#define LL_MDMA_ReadReg(__INSTANCE__, __REG__) READ_REG((__INSTANCE__)->__REG__)
/**
  * @}
  */

/** @defgroup MDMA_LL_EM_CONVERT_DMAxCHANNELy Convert MDMAxChannely
  * @{
  */
/**
  * @brief  Convert MDMAx_Channely into MDMAx
  * @param  __CHANNEL_INSTANCE__ MDMAx_Channely
  * @retval MDMAx
  */
#define LL_MDMA_GET_INSTANCE(__CHANNEL_INSTANCE__) (MDMA)

/**
  * @brief  Convert MDMAx_Channely into LL_MDMA_CHANNEL_y
  * @param  __CHANNEL_INSTANCE__ MDMAx_Channely
  * @retval LL_MDMA_CHANNEL_y
  */
#define LL_MDMA_GET_CHANNEL(__CHANNEL_INSTANCE__)   \
  (((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)MDMA_Channel0 )) ? LL_MDMA_CHANNEL_0  : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)MDMA_Channel1 )) ? LL_MDMA_CHANNEL_1  : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)MDMA_Channel2 )) ? LL_MDMA_CHANNEL_2  : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)MDMA_Channel3 )) ? LL_MDMA_CHANNEL_3  : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)MDMA_Channel4 )) ? LL_MDMA_CHANNEL_4  : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)MDMA_Channel5 )) ? LL_MDMA_CHANNEL_5  : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)MDMA_Channel6 )) ? LL_MDMA_CHANNEL_6  : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)MDMA_Channel7 )) ? LL_MDMA_CHANNEL_7  : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)MDMA_Channel8 )) ? LL_MDMA_CHANNEL_8  : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)MDMA_Channel9 )) ? LL_MDMA_CHANNEL_9  : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)MDMA_Channel10)) ? LL_MDMA_CHANNEL_10 : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)MDMA_Channel11)) ? LL_MDMA_CHANNEL_11 : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)MDMA_Channel12)) ? LL_MDMA_CHANNEL_12 : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)MDMA_Channel13)) ? LL_MDMA_CHANNEL_13 : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)MDMA_Channel14)) ? LL_MDMA_CHANNEL_14 : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)MDMA_Channel15)) ? LL_MDMA_CHANNEL_15 : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)MDMA_Channel16)) ? LL_MDMA_CHANNEL_16 : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)MDMA_Channel17)) ? LL_MDMA_CHANNEL_17 : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)MDMA_Channel18)) ? LL_MDMA_CHANNEL_18 : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)MDMA_Channel19)) ? LL_MDMA_CHANNEL_19 : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)MDMA_Channel20)) ? LL_MDMA_CHANNEL_20 : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)MDMA_Channel21)) ? LL_MDMA_CHANNEL_21 : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)MDMA_Channel22)) ? LL_MDMA_CHANNEL_22 : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)MDMA_Channel23)) ? LL_MDMA_CHANNEL_23 : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)MDMA_Channel24)) ? LL_MDMA_CHANNEL_24 : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)MDMA_Channel25)) ? LL_MDMA_CHANNEL_25 : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)MDMA_Channel26)) ? LL_MDMA_CHANNEL_26 : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)MDMA_Channel27)) ? LL_MDMA_CHANNEL_27 : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)MDMA_Channel28)) ? LL_MDMA_CHANNEL_28 : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)MDMA_Channel29)) ? LL_MDMA_CHANNEL_29 : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)MDMA_Channel30)) ? LL_MDMA_CHANNEL_30 : \
   LL_MDMA_CHANNEL_31)

/**
  * @brief  Convert MDMA Instance MDMAx and LL_MDMA_CHANNEL_y into MDMAx_Channely
  * @param  __MDMA_INSTANCE__ MDMAx
  * @param  __CHANNEL__ LL_MDMA_CHANNEL_y
  * @retval MDMAx_Channely
  */
#define LL_MDMA_GET_CHANNEL_INSTANCE(__MDMA_INSTANCE__, __CHANNEL__)   \
  (((uint32_t)(__CHANNEL__) == ((uint32_t)LL_MDMA_CHANNEL_0 )) ? MDMA_Channel0  : \
   ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_MDMA_CHANNEL_1 )) ? MDMA_Channel1  : \
   ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_MDMA_CHANNEL_2 )) ? MDMA_Channel2  : \
   ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_MDMA_CHANNEL_3 )) ? MDMA_Channel3  : \
   ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_MDMA_CHANNEL_4 )) ? MDMA_Channel4  : \
   ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_MDMA_CHANNEL_5 )) ? MDMA_Channel5  : \
   ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_MDMA_CHANNEL_6 )) ? MDMA_Channel6  : \
   ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_MDMA_CHANNEL_7 )) ? MDMA_Channel7  : \
   ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_MDMA_CHANNEL_8 )) ? MDMA_Channel8  : \
   ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_MDMA_CHANNEL_9 )) ? MDMA_Channel9  : \
   ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_MDMA_CHANNEL_10)) ? MDMA_Channel10 : \
   ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_MDMA_CHANNEL_11)) ? MDMA_Channel11 : \
   ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_MDMA_CHANNEL_12)) ? MDMA_Channel12 : \
   ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_MDMA_CHANNEL_13)) ? MDMA_Channel13 : \
   ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_MDMA_CHANNEL_14)) ? MDMA_Channel14 : \
   ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_MDMA_CHANNEL_15)) ? MDMA_Channel15 : \
   ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_MDMA_CHANNEL_16)) ? MDMA_Channel16 : \
   ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_MDMA_CHANNEL_17)) ? MDMA_Channel17 : \
   ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_MDMA_CHANNEL_18)) ? MDMA_Channel18 : \
   ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_MDMA_CHANNEL_19)) ? MDMA_Channel19 : \
   ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_MDMA_CHANNEL_20)) ? MDMA_Channel20 : \
   ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_MDMA_CHANNEL_21)) ? MDMA_Channel21 : \
   ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_MDMA_CHANNEL_22)) ? MDMA_Channel22 : \
   ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_MDMA_CHANNEL_23)) ? MDMA_Channel23 : \
   ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_MDMA_CHANNEL_24)) ? MDMA_Channel24 : \
   ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_MDMA_CHANNEL_25)) ? MDMA_Channel25 : \
   ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_MDMA_CHANNEL_26)) ? MDMA_Channel26 : \
   ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_MDMA_CHANNEL_27)) ? MDMA_Channel27 : \
   ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_MDMA_CHANNEL_28)) ? MDMA_Channel28 : \
   ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_MDMA_CHANNEL_29)) ? MDMA_Channel29 : \
   ((uint32_t)(__CHANNEL__) == ((uint32_t)LL_MDMA_CHANNEL_30)) ? MDMA_Channel30 : \
   MDMA_Channel31)

/**
  * @}
  */

/**
  * @}
  */


/* Exported functions --------------------------------------------------------*/
/** @defgroup MDMA_LL_Exported_Functions MDMA Exported Functions
  * @{
 */

/** @defgroup MDMA_LL_EF_Configuration Configuration
  * @{
  */
/**
  * @brief Enable MDMA channel.
  * @rmtoll CCR          EN            LL_MDMA_EnableChannel
  * @param  MDMAx MDMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_CHANNEL_0
  *         @arg @ref LL_MDMA_CHANNEL_1
  *         @arg @ref LL_MDMA_CHANNEL_2
  *         @arg @ref LL_MDMA_CHANNEL_3
  *         @arg @ref LL_MDMA_CHANNEL_4
  *         @arg @ref LL_MDMA_CHANNEL_5
  *         @arg @ref LL_MDMA_CHANNEL_6
  *         @arg @ref LL_MDMA_CHANNEL_7
  *         @arg @ref LL_MDMA_CHANNEL_8
  *         @arg @ref LL_MDMA_CHANNEL_9
  *         @arg @ref LL_MDMA_CHANNEL_10
  *         @arg @ref LL_MDMA_CHANNEL_11
  *         @arg @ref LL_MDMA_CHANNEL_12
  *         @arg @ref LL_MDMA_CHANNEL_13
  *         @arg @ref LL_MDMA_CHANNEL_14
  *         @arg @ref LL_MDMA_CHANNEL_15
  *         @arg @ref LL_MDMA_CHANNEL_16
  *         @arg @ref LL_MDMA_CHANNEL_17
  *         @arg @ref LL_MDMA_CHANNEL_18
  *         @arg @ref LL_MDMA_CHANNEL_19
  *         @arg @ref LL_MDMA_CHANNEL_20
  *         @arg @ref LL_MDMA_CHANNEL_21
  *         @arg @ref LL_MDMA_CHANNEL_22
  *         @arg @ref LL_MDMA_CHANNEL_23
  *         @arg @ref LL_MDMA_CHANNEL_24
  *         @arg @ref LL_MDMA_CHANNEL_25
  *         @arg @ref LL_MDMA_CHANNEL_26
  *         @arg @ref LL_MDMA_CHANNEL_27
  *         @arg @ref LL_MDMA_CHANNEL_28
  *         @arg @ref LL_MDMA_CHANNEL_29
  *         @arg @ref LL_MDMA_CHANNEL_30
  *         @arg @ref LL_MDMA_CHANNEL_31
  * @retval None
  */
__STATIC_INLINE void LL_MDMA_EnableChannel(MDMA_TypeDef *MDMAx, uint32_t Channel)
{
  uint32_t mdma_base_addr = (uint32_t)MDMAx;

