zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_mdma.h
  SET_BIT(((MDMA_Channel_TypeDef *)(mdma_base_addr + LL_MDMA_CH_OFFSET_TAB[Channel]))->CCR, MDMA_CCR_EN);
}

/**
  * @brief Disable MDMA channel.
  * @rmtoll CCR          EN            LL_MDMA_DisableChannel
  * @param  MDMAx MDMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_CHANNEL_0
  *         @arg @ref LL_MDMA_CHANNEL_1
  *         @arg @ref LL_MDMA_CHANNEL_2
  *         @arg @ref LL_MDMA_CHANNEL_3
  *         @arg @ref LL_MDMA_CHANNEL_4
  *         @arg @ref LL_MDMA_CHANNEL_5
  *         @arg @ref LL_MDMA_CHANNEL_6
  *         @arg @ref LL_MDMA_CHANNEL_7
  *         @arg @ref LL_MDMA_CHANNEL_8
  *         @arg @ref LL_MDMA_CHANNEL_9
  *         @arg @ref LL_MDMA_CHANNEL_10
  *         @arg @ref LL_MDMA_CHANNEL_11
  *         @arg @ref LL_MDMA_CHANNEL_12
  *         @arg @ref LL_MDMA_CHANNEL_13
  *         @arg @ref LL_MDMA_CHANNEL_14
  *         @arg @ref LL_MDMA_CHANNEL_15
  *         @arg @ref LL_MDMA_CHANNEL_16
  *         @arg @ref LL_MDMA_CHANNEL_17
  *         @arg @ref LL_MDMA_CHANNEL_18
  *         @arg @ref LL_MDMA_CHANNEL_19
  *         @arg @ref LL_MDMA_CHANNEL_20
  *         @arg @ref LL_MDMA_CHANNEL_21
  *         @arg @ref LL_MDMA_CHANNEL_22
  *         @arg @ref LL_MDMA_CHANNEL_23
  *         @arg @ref LL_MDMA_CHANNEL_24
  *         @arg @ref LL_MDMA_CHANNEL_25
  *         @arg @ref LL_MDMA_CHANNEL_26
  *         @arg @ref LL_MDMA_CHANNEL_27
  *         @arg @ref LL_MDMA_CHANNEL_28
  *         @arg @ref LL_MDMA_CHANNEL_29
  *         @arg @ref LL_MDMA_CHANNEL_30
  *         @arg @ref LL_MDMA_CHANNEL_31
  * @retval None
  */
__STATIC_INLINE void LL_MDMA_DisableChannel(MDMA_TypeDef *MDMAx, uint32_t Channel)
{
  uint32_t mdma_base_addr = (uint32_t)MDMAx;

  CLEAR_BIT(((MDMA_Channel_TypeDef *)(mdma_base_addr + LL_MDMA_CH_OFFSET_TAB[Channel]))->CCR, MDMA_CCR_EN);
}

/**
  * @brief Check if MDMA channel is enabled or disabled.
  * @rmtoll CCR          EN            LL_MDMA_IsEnabledChannel
  * @param  MDMAx MDMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_CHANNEL_0
  *         @arg @ref LL_MDMA_CHANNEL_1
  *         @arg @ref LL_MDMA_CHANNEL_2
  *         @arg @ref LL_MDMA_CHANNEL_3
  *         @arg @ref LL_MDMA_CHANNEL_4
  *         @arg @ref LL_MDMA_CHANNEL_5
  *         @arg @ref LL_MDMA_CHANNEL_6
  *         @arg @ref LL_MDMA_CHANNEL_7
  *         @arg @ref LL_MDMA_CHANNEL_8
  *         @arg @ref LL_MDMA_CHANNEL_9
  *         @arg @ref LL_MDMA_CHANNEL_10
  *         @arg @ref LL_MDMA_CHANNEL_11
  *         @arg @ref LL_MDMA_CHANNEL_12
  *         @arg @ref LL_MDMA_CHANNEL_13
  *         @arg @ref LL_MDMA_CHANNEL_14
  *         @arg @ref LL_MDMA_CHANNEL_15
  *         @arg @ref LL_MDMA_CHANNEL_16
  *         @arg @ref LL_MDMA_CHANNEL_17
  *         @arg @ref LL_MDMA_CHANNEL_18
  *         @arg @ref LL_MDMA_CHANNEL_19
  *         @arg @ref LL_MDMA_CHANNEL_20
  *         @arg @ref LL_MDMA_CHANNEL_21
  *         @arg @ref LL_MDMA_CHANNEL_22
  *         @arg @ref LL_MDMA_CHANNEL_23
  *         @arg @ref LL_MDMA_CHANNEL_24
  *         @arg @ref LL_MDMA_CHANNEL_25
  *         @arg @ref LL_MDMA_CHANNEL_26
  *         @arg @ref LL_MDMA_CHANNEL_27
  *         @arg @ref LL_MDMA_CHANNEL_28
  *         @arg @ref LL_MDMA_CHANNEL_29
  *         @arg @ref LL_MDMA_CHANNEL_30
  *         @arg @ref LL_MDMA_CHANNEL_31
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_MDMA_IsEnabledChannel(MDMA_TypeDef *MDMAx, uint32_t Channel)
{
  uint32_t mdma_base_addr = (uint32_t)MDMAx;

  return ((READ_BIT(((MDMA_Channel_TypeDef *)(mdma_base_addr + LL_MDMA_CH_OFFSET_TAB[Channel]))->CCR,
                    MDMA_CCR_EN) == (MDMA_CCR_EN)) ? 1UL : 0UL);
}

/**
  * @brief Generate a SW transfer request on the MDMA channel.
  * @rmtoll CCR          SWRQ            LL_MDMA_GenerateSWRequest
  * @param  MDMAx MDMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_CHANNEL_0
  *         @arg @ref LL_MDMA_CHANNEL_1
  *         @arg @ref LL_MDMA_CHANNEL_2
  *         @arg @ref LL_MDMA_CHANNEL_3
  *         @arg @ref LL_MDMA_CHANNEL_4
  *         @arg @ref LL_MDMA_CHANNEL_5
  *         @arg @ref LL_MDMA_CHANNEL_6
  *         @arg @ref LL_MDMA_CHANNEL_7
  *         @arg @ref LL_MDMA_CHANNEL_8
  *         @arg @ref LL_MDMA_CHANNEL_9
  *         @arg @ref LL_MDMA_CHANNEL_10
  *         @arg @ref LL_MDMA_CHANNEL_11
  *         @arg @ref LL_MDMA_CHANNEL_12
  *         @arg @ref LL_MDMA_CHANNEL_13
  *         @arg @ref LL_MDMA_CHANNEL_14
  *         @arg @ref LL_MDMA_CHANNEL_15
  *         @arg @ref LL_MDMA_CHANNEL_16
  *         @arg @ref LL_MDMA_CHANNEL_17
  *         @arg @ref LL_MDMA_CHANNEL_18
  *         @arg @ref LL_MDMA_CHANNEL_19
  *         @arg @ref LL_MDMA_CHANNEL_20
  *         @arg @ref LL_MDMA_CHANNEL_21
  *         @arg @ref LL_MDMA_CHANNEL_22
  *         @arg @ref LL_MDMA_CHANNEL_23
  *         @arg @ref LL_MDMA_CHANNEL_24
  *         @arg @ref LL_MDMA_CHANNEL_25
  *         @arg @ref LL_MDMA_CHANNEL_26
  *         @arg @ref LL_MDMA_CHANNEL_27
  *         @arg @ref LL_MDMA_CHANNEL_28
  *         @arg @ref LL_MDMA_CHANNEL_29
  *         @arg @ref LL_MDMA_CHANNEL_30
  *         @arg @ref LL_MDMA_CHANNEL_31
  * @retval None
  */
__STATIC_INLINE void LL_MDMA_GenerateSWRequest(MDMA_TypeDef *MDMAx, uint32_t Channel)
{
  uint32_t mdma_base_addr = (uint32_t)MDMAx;

  SET_BIT(((MDMA_Channel_TypeDef *)(mdma_base_addr + LL_MDMA_CH_OFFSET_TAB[Channel]))->CCR, MDMA_CCR_SWRQ);
}

/**
  * @brief Configure Transfer endianness parameters : Word, Half word and Bytes Endianness.
  * @rmtoll CCR          WEX            LL_MDMA_ConfigXferEndianness\n
  * @rmtoll CCR          HEX            LL_MDMA_ConfigXferEndianness\n
  * @rmtoll CCR          BEX            LL_MDMA_ConfigXferEndianness
  * @param  MDMAx MDMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_CHANNEL_0
  *         @arg @ref LL_MDMA_CHANNEL_1
  *         @arg @ref LL_MDMA_CHANNEL_2
  *         @arg @ref LL_MDMA_CHANNEL_3
  *         @arg @ref LL_MDMA_CHANNEL_4
  *         @arg @ref LL_MDMA_CHANNEL_5
  *         @arg @ref LL_MDMA_CHANNEL_6
  *         @arg @ref LL_MDMA_CHANNEL_7
  *         @arg @ref LL_MDMA_CHANNEL_8
  *         @arg @ref LL_MDMA_CHANNEL_9
  *         @arg @ref LL_MDMA_CHANNEL_10
  *         @arg @ref LL_MDMA_CHANNEL_11
  *         @arg @ref LL_MDMA_CHANNEL_12
  *         @arg @ref LL_MDMA_CHANNEL_13
  *         @arg @ref LL_MDMA_CHANNEL_14
  *         @arg @ref LL_MDMA_CHANNEL_15
  *         @arg @ref LL_MDMA_CHANNEL_16
  *         @arg @ref LL_MDMA_CHANNEL_17
  *         @arg @ref LL_MDMA_CHANNEL_18
  *         @arg @ref LL_MDMA_CHANNEL_19
  *         @arg @ref LL_MDMA_CHANNEL_20
  *         @arg @ref LL_MDMA_CHANNEL_21
  *         @arg @ref LL_MDMA_CHANNEL_22
  *         @arg @ref LL_MDMA_CHANNEL_23
  *         @arg @ref LL_MDMA_CHANNEL_24
  *         @arg @ref LL_MDMA_CHANNEL_25
  *         @arg @ref LL_MDMA_CHANNEL_26
  *         @arg @ref LL_MDMA_CHANNEL_27
  *         @arg @ref LL_MDMA_CHANNEL_28
  *         @arg @ref LL_MDMA_CHANNEL_29
  *         @arg @ref LL_MDMA_CHANNEL_30
  *         @arg @ref LL_MDMA_CHANNEL_31
  * @param  Configuration This parameter must be a combination of all the following values:
  *         @arg @ref LL_MDMA_WORD_ENDIANNESS_PRESERVE or @ref LL_MDMA_WORD_ENDIANNESS_EXCHANGE
  *         @arg @ref LL_MDMA_HALFWORD_ENDIANNESS_PRESERVE or @ref LL_MDMA_HALFWORD_ENDIANNESS_EXCHANGE
  *         @arg @ref LL_MDMA_BYTE_ENDIANNESS_PRESERVE or @ref LL_MDMA_BYTE_ENDIANNESS_EXCHANGE
  * @retval None
  */
__STATIC_INLINE void LL_MDMA_ConfigXferEndianness(MDMA_TypeDef *MDMAx, uint32_t Channel, uint32_t Configuration)
{
  uint32_t mdma_base_addr = (uint32_t)MDMAx;

  MODIFY_REG(((MDMA_Channel_TypeDef *)(mdma_base_addr + LL_MDMA_CH_OFFSET_TAB[Channel]))->CCR,
             MDMA_CCR_WEX | MDMA_CCR_HEX | MDMA_CCR_BEX, Configuration);
}

/**
  * @brief Set Words Endianness.
  * @rmtoll CCR          WEX            LL_MDMA_SetWordEndianness
  * @param  MDMAx MDMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_CHANNEL_0
  *         @arg @ref LL_MDMA_CHANNEL_1
  *         @arg @ref LL_MDMA_CHANNEL_2
  *         @arg @ref LL_MDMA_CHANNEL_3
  *         @arg @ref LL_MDMA_CHANNEL_4
  *         @arg @ref LL_MDMA_CHANNEL_5
  *         @arg @ref LL_MDMA_CHANNEL_6
  *         @arg @ref LL_MDMA_CHANNEL_7
  *         @arg @ref LL_MDMA_CHANNEL_8
  *         @arg @ref LL_MDMA_CHANNEL_9
  *         @arg @ref LL_MDMA_CHANNEL_10
  *         @arg @ref LL_MDMA_CHANNEL_11
  *         @arg @ref LL_MDMA_CHANNEL_12
  *         @arg @ref LL_MDMA_CHANNEL_13
  *         @arg @ref LL_MDMA_CHANNEL_14
  *         @arg @ref LL_MDMA_CHANNEL_15
  *         @arg @ref LL_MDMA_CHANNEL_16
  *         @arg @ref LL_MDMA_CHANNEL_17
  *         @arg @ref LL_MDMA_CHANNEL_18
  *         @arg @ref LL_MDMA_CHANNEL_19
  *         @arg @ref LL_MDMA_CHANNEL_20
  *         @arg @ref LL_MDMA_CHANNEL_21
  *         @arg @ref LL_MDMA_CHANNEL_22
  *         @arg @ref LL_MDMA_CHANNEL_23
  *         @arg @ref LL_MDMA_CHANNEL_24
  *         @arg @ref LL_MDMA_CHANNEL_25
  *         @arg @ref LL_MDMA_CHANNEL_26
  *         @arg @ref LL_MDMA_CHANNEL_27
  *         @arg @ref LL_MDMA_CHANNEL_28
  *         @arg @ref LL_MDMA_CHANNEL_29
  *         @arg @ref LL_MDMA_CHANNEL_30
  *         @arg @ref LL_MDMA_CHANNEL_31
  * @param  Endianness This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_WORD_ENDIANNESS_PRESERVE
  *         @arg @ref LL_MDMA_WORD_ENDIANNESS_EXCHANGE
  * @retval None
  */
__STATIC_INLINE void LL_MDMA_SetWordEndianness(MDMA_TypeDef *MDMAx, uint32_t Channel, uint32_t Endianness)
{
  uint32_t mdma_base_addr = (uint32_t)MDMAx;

  MODIFY_REG(((MDMA_Channel_TypeDef *)(mdma_base_addr + LL_MDMA_CH_OFFSET_TAB[Channel]))->CCR,
             MDMA_CCR_WEX, Endianness);
}

/**
  * @brief Get Words Endianness.
  * @rmtoll CCR          WEX            LL_MDMA_GetWordEndianness
  * @param  MDMAx MDMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_CHANNEL_0
  *         @arg @ref LL_MDMA_CHANNEL_1
  *         @arg @ref LL_MDMA_CHANNEL_2
  *         @arg @ref LL_MDMA_CHANNEL_3
  *         @arg @ref LL_MDMA_CHANNEL_4
  *         @arg @ref LL_MDMA_CHANNEL_5
  *         @arg @ref LL_MDMA_CHANNEL_6
  *         @arg @ref LL_MDMA_CHANNEL_7
  *         @arg @ref LL_MDMA_CHANNEL_8
  *         @arg @ref LL_MDMA_CHANNEL_9
  *         @arg @ref LL_MDMA_CHANNEL_10
  *         @arg @ref LL_MDMA_CHANNEL_11
  *         @arg @ref LL_MDMA_CHANNEL_12
  *         @arg @ref LL_MDMA_CHANNEL_13
  *         @arg @ref LL_MDMA_CHANNEL_14
  *         @arg @ref LL_MDMA_CHANNEL_15
  *         @arg @ref LL_MDMA_CHANNEL_16
  *         @arg @ref LL_MDMA_CHANNEL_17
  *         @arg @ref LL_MDMA_CHANNEL_18
  *         @arg @ref LL_MDMA_CHANNEL_19
  *         @arg @ref LL_MDMA_CHANNEL_20
  *         @arg @ref LL_MDMA_CHANNEL_21
  *         @arg @ref LL_MDMA_CHANNEL_22
  *         @arg @ref LL_MDMA_CHANNEL_23
  *         @arg @ref LL_MDMA_CHANNEL_24
  *         @arg @ref LL_MDMA_CHANNEL_25
  *         @arg @ref LL_MDMA_CHANNEL_26
  *         @arg @ref LL_MDMA_CHANNEL_27
  *         @arg @ref LL_MDMA_CHANNEL_28
  *         @arg @ref LL_MDMA_CHANNEL_29
  *         @arg @ref LL_MDMA_CHANNEL_30
  *         @arg @ref LL_MDMA_CHANNEL_31
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_MDMA_WORD_ENDIANNESS_PRESERVE
  *         @arg @ref LL_MDMA_WORD_ENDIANNESS_EXCHANGE
  * @retval None
  */
__STATIC_INLINE uint32_t LL_MDMA_GetWordEndianness(MDMA_TypeDef *MDMAx, uint32_t Channel)
{
  uint32_t mdma_base_addr = (uint32_t)MDMAx;

  return (READ_BIT(((MDMA_Channel_TypeDef *)(mdma_base_addr + LL_MDMA_CH_OFFSET_TAB[Channel]))->CCR, MDMA_CCR_WEX));
}

/**
  * @brief Set Half Words Endianness.
  * @rmtoll CCR          HEX            LL_MDMA_SetHalfWordEndianness
  * @param  MDMAx MDMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_CHANNEL_0
  *         @arg @ref LL_MDMA_CHANNEL_1
  *         @arg @ref LL_MDMA_CHANNEL_2
  *         @arg @ref LL_MDMA_CHANNEL_3
  *         @arg @ref LL_MDMA_CHANNEL_4
  *         @arg @ref LL_MDMA_CHANNEL_5
  *         @arg @ref LL_MDMA_CHANNEL_6
  *         @arg @ref LL_MDMA_CHANNEL_7
  *         @arg @ref LL_MDMA_CHANNEL_8
  *         @arg @ref LL_MDMA_CHANNEL_9
  *         @arg @ref LL_MDMA_CHANNEL_10
  *         @arg @ref LL_MDMA_CHANNEL_11
  *         @arg @ref LL_MDMA_CHANNEL_12
  *         @arg @ref LL_MDMA_CHANNEL_13
  *         @arg @ref LL_MDMA_CHANNEL_14
  *         @arg @ref LL_MDMA_CHANNEL_15
  *         @arg @ref LL_MDMA_CHANNEL_16
  *         @arg @ref LL_MDMA_CHANNEL_17
  *         @arg @ref LL_MDMA_CHANNEL_18
  *         @arg @ref LL_MDMA_CHANNEL_19
  *         @arg @ref LL_MDMA_CHANNEL_20
  *         @arg @ref LL_MDMA_CHANNEL_21
  *         @arg @ref LL_MDMA_CHANNEL_22
  *         @arg @ref LL_MDMA_CHANNEL_23
  *         @arg @ref LL_MDMA_CHANNEL_24
  *         @arg @ref LL_MDMA_CHANNEL_25
  *         @arg @ref LL_MDMA_CHANNEL_26
  *         @arg @ref LL_MDMA_CHANNEL_27
  *         @arg @ref LL_MDMA_CHANNEL_28
  *         @arg @ref LL_MDMA_CHANNEL_29
  *         @arg @ref LL_MDMA_CHANNEL_30
  *         @arg @ref LL_MDMA_CHANNEL_31
  * @param  Endianness This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_HALFWORD_ENDIANNESS_PRESERVE
  *         @arg @ref LL_MDMA_HALFWORD_ENDIANNESS_EXCHANGE
  * @retval None
  */
__STATIC_INLINE void LL_MDMA_SetHalfWordEndianness(MDMA_TypeDef *MDMAx, uint32_t Channel, uint32_t Endianness)
{
  uint32_t mdma_base_addr = (uint32_t)MDMAx;

  MODIFY_REG(((MDMA_Channel_TypeDef *)(mdma_base_addr + LL_MDMA_CH_OFFSET_TAB[Channel]))->CCR,
             MDMA_CCR_HEX, Endianness);
}

/**
  * @brief Get Half Words Endianness.
  * @rmtoll CCR          HEX            LL_MDMA_GetHalfWordEndianness
  * @param  MDMAx MDMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_CHANNEL_0
  *         @arg @ref LL_MDMA_CHANNEL_1
  *         @arg @ref LL_MDMA_CHANNEL_2
  *         @arg @ref LL_MDMA_CHANNEL_3
  *         @arg @ref LL_MDMA_CHANNEL_4
  *         @arg @ref LL_MDMA_CHANNEL_5
  *         @arg @ref LL_MDMA_CHANNEL_6
  *         @arg @ref LL_MDMA_CHANNEL_7
  *         @arg @ref LL_MDMA_CHANNEL_8
  *         @arg @ref LL_MDMA_CHANNEL_9
  *         @arg @ref LL_MDMA_CHANNEL_10
  *         @arg @ref LL_MDMA_CHANNEL_11
  *         @arg @ref LL_MDMA_CHANNEL_12
  *         @arg @ref LL_MDMA_CHANNEL_13
  *         @arg @ref LL_MDMA_CHANNEL_14
  *         @arg @ref LL_MDMA_CHANNEL_15
  *         @arg @ref LL_MDMA_CHANNEL_16
  *         @arg @ref LL_MDMA_CHANNEL_17
  *         @arg @ref LL_MDMA_CHANNEL_18
  *         @arg @ref LL_MDMA_CHANNEL_19
  *         @arg @ref LL_MDMA_CHANNEL_20
  *         @arg @ref LL_MDMA_CHANNEL_21
  *         @arg @ref LL_MDMA_CHANNEL_22
  *         @arg @ref LL_MDMA_CHANNEL_23
  *         @arg @ref LL_MDMA_CHANNEL_24
  *         @arg @ref LL_MDMA_CHANNEL_25
  *         @arg @ref LL_MDMA_CHANNEL_26
  *         @arg @ref LL_MDMA_CHANNEL_27
  *         @arg @ref LL_MDMA_CHANNEL_28
  *         @arg @ref LL_MDMA_CHANNEL_29
  *         @arg @ref LL_MDMA_CHANNEL_30
  *         @arg @ref LL_MDMA_CHANNEL_31
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_MDMA_HALFWORD_ENDIANNESS_PRESERVE
  *         @arg @ref LL_MDMA_HALFWORD_ENDIANNESS_EXCHANGE
  * @retval None
  */
__STATIC_INLINE uint32_t LL_MDMA_GetHalfWordEndianness(MDMA_TypeDef *MDMAx, uint32_t Channel)
{
  uint32_t mdma_base_addr = (uint32_t)MDMAx;

  return (READ_BIT(((MDMA_Channel_TypeDef *)(mdma_base_addr + LL_MDMA_CH_OFFSET_TAB[Channel]))->CCR, MDMA_CCR_HEX));
}

/**
  * @brief Set Bytes Endianness.
  * @rmtoll CCR          BEX            LL_MDMA_SetByteEndianness
  * @param  MDMAx MDMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_CHANNEL_0
  *         @arg @ref LL_MDMA_CHANNEL_1
  *         @arg @ref LL_MDMA_CHANNEL_2
  *         @arg @ref LL_MDMA_CHANNEL_3
  *         @arg @ref LL_MDMA_CHANNEL_4
  *         @arg @ref LL_MDMA_CHANNEL_5
  *         @arg @ref LL_MDMA_CHANNEL_6
  *         @arg @ref LL_MDMA_CHANNEL_7
  *         @arg @ref LL_MDMA_CHANNEL_8
  *         @arg @ref LL_MDMA_CHANNEL_9
  *         @arg @ref LL_MDMA_CHANNEL_10
  *         @arg @ref LL_MDMA_CHANNEL_11
  *         @arg @ref LL_MDMA_CHANNEL_12
  *         @arg @ref LL_MDMA_CHANNEL_13
  *         @arg @ref LL_MDMA_CHANNEL_14
  *         @arg @ref LL_MDMA_CHANNEL_15
  *         @arg @ref LL_MDMA_CHANNEL_16
  *         @arg @ref LL_MDMA_CHANNEL_17
  *         @arg @ref LL_MDMA_CHANNEL_18
  *         @arg @ref LL_MDMA_CHANNEL_19
  *         @arg @ref LL_MDMA_CHANNEL_20
  *         @arg @ref LL_MDMA_CHANNEL_21
  *         @arg @ref LL_MDMA_CHANNEL_22
  *         @arg @ref LL_MDMA_CHANNEL_23
  *         @arg @ref LL_MDMA_CHANNEL_24
  *         @arg @ref LL_MDMA_CHANNEL_25
  *         @arg @ref LL_MDMA_CHANNEL_26
  *         @arg @ref LL_MDMA_CHANNEL_27
  *         @arg @ref LL_MDMA_CHANNEL_28
  *         @arg @ref LL_MDMA_CHANNEL_29
  *         @arg @ref LL_MDMA_CHANNEL_30
  *         @arg @ref LL_MDMA_CHANNEL_31
  * @param  Endianness This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_BYTE_ENDIANNESS_PRESERVE
  *         @arg @ref LL_MDMA_BYTE_ENDIANNESS_EXCHANGE
  * @retval None
  */
__STATIC_INLINE void LL_MDMA_SetByteEndianness(MDMA_TypeDef *MDMAx, uint32_t Channel, uint32_t Endianness)
{
  uint32_t mdma_base_addr = (uint32_t)MDMAx;

  MODIFY_REG(((MDMA_Channel_TypeDef *)(mdma_base_addr + LL_MDMA_CH_OFFSET_TAB[Channel]))->CCR,
             MDMA_CCR_BEX, Endianness);
}

/**
  * @brief Get Bytes Endianness.
  * @rmtoll CCR          BEX            LL_MDMA_GetByteEndianness
  * @param  MDMAx MDMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_CHANNEL_0
  *         @arg @ref LL_MDMA_CHANNEL_1
  *         @arg @ref LL_MDMA_CHANNEL_2
  *         @arg @ref LL_MDMA_CHANNEL_3
  *         @arg @ref LL_MDMA_CHANNEL_4
  *         @arg @ref LL_MDMA_CHANNEL_5
  *         @arg @ref LL_MDMA_CHANNEL_6
  *         @arg @ref LL_MDMA_CHANNEL_7
  *         @arg @ref LL_MDMA_CHANNEL_8
  *         @arg @ref LL_MDMA_CHANNEL_9
  *         @arg @ref LL_MDMA_CHANNEL_10
  *         @arg @ref LL_MDMA_CHANNEL_11
  *         @arg @ref LL_MDMA_CHANNEL_12
  *         @arg @ref LL_MDMA_CHANNEL_13
  *         @arg @ref LL_MDMA_CHANNEL_14
  *         @arg @ref LL_MDMA_CHANNEL_15
  *         @arg @ref LL_MDMA_CHANNEL_16
  *         @arg @ref LL_MDMA_CHANNEL_17
  *         @arg @ref LL_MDMA_CHANNEL_18
  *         @arg @ref LL_MDMA_CHANNEL_19
  *         @arg @ref LL_MDMA_CHANNEL_20
  *         @arg @ref LL_MDMA_CHANNEL_21
  *         @arg @ref LL_MDMA_CHANNEL_22
  *         @arg @ref LL_MDMA_CHANNEL_23
  *         @arg @ref LL_MDMA_CHANNEL_24
  *         @arg @ref LL_MDMA_CHANNEL_25
  *         @arg @ref LL_MDMA_CHANNEL_26
  *         @arg @ref LL_MDMA_CHANNEL_27
  *         @arg @ref LL_MDMA_CHANNEL_28
  *         @arg @ref LL_MDMA_CHANNEL_29
  *         @arg @ref LL_MDMA_CHANNEL_30
  *         @arg @ref LL_MDMA_CHANNEL_31
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_MDMA_BYTE_ENDIANNESS_PRESERVE
  *         @arg @ref LL_MDMA_BYTE_ENDIANNESS_EXCHANGE
  * @retval None
  */
__STATIC_INLINE uint32_t LL_MDMA_GetByteEndianness(MDMA_TypeDef *MDMAx, uint32_t Channel)
{
  uint32_t mdma_base_addr = (uint32_t)MDMAx;

  return (READ_BIT(((MDMA_Channel_TypeDef *)(mdma_base_addr + LL_MDMA_CH_OFFSET_TAB[Channel]))->CCR, MDMA_CCR_BEX));
}

/**
  * @brief Set Channel priority level.
  * @rmtoll CCR          PL            LL_MDMA_SetChannelPriorityLevel
  * @param  MDMAx MDMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_CHANNEL_0
  *         @arg @ref LL_MDMA_CHANNEL_1
  *         @arg @ref LL_MDMA_CHANNEL_2
  *         @arg @ref LL_MDMA_CHANNEL_3
  *         @arg @ref LL_MDMA_CHANNEL_4
  *         @arg @ref LL_MDMA_CHANNEL_5
  *         @arg @ref LL_MDMA_CHANNEL_6
  *         @arg @ref LL_MDMA_CHANNEL_7
  *         @arg @ref LL_MDMA_CHANNEL_8
  *         @arg @ref LL_MDMA_CHANNEL_9
  *         @arg @ref LL_MDMA_CHANNEL_10
  *         @arg @ref LL_MDMA_CHANNEL_11
  *         @arg @ref LL_MDMA_CHANNEL_12
  *         @arg @ref LL_MDMA_CHANNEL_13
  *         @arg @ref LL_MDMA_CHANNEL_14
  *         @arg @ref LL_MDMA_CHANNEL_16
  *         @arg @ref LL_MDMA_CHANNEL_17
  *         @arg @ref LL_MDMA_CHANNEL_18
  *         @arg @ref LL_MDMA_CHANNEL_19
  *         @arg @ref LL_MDMA_CHANNEL_20
  *         @arg @ref LL_MDMA_CHANNEL_21
  *         @arg @ref LL_MDMA_CHANNEL_22
  *         @arg @ref LL_MDMA_CHANNEL_23
  *         @arg @ref LL_MDMA_CHANNEL_24
  *         @arg @ref LL_MDMA_CHANNEL_25
  *         @arg @ref LL_MDMA_CHANNEL_26
  *         @arg @ref LL_MDMA_CHANNEL_27
  *         @arg @ref LL_MDMA_CHANNEL_28
  *         @arg @ref LL_MDMA_CHANNEL_29
  *         @arg @ref LL_MDMA_CHANNEL_30
  *         @arg @ref LL_MDMA_CHANNEL_31
  *         @arg @ref LL_MDMA_CHANNEL_15
  * @param  Priority This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_PRIORITY_LOW
  *         @arg @ref LL_MDMA_PRIORITY_MEDIUM
  *         @arg @ref LL_MDMA_PRIORITY_HIGH
  *         @arg @ref LL_MDMA_PRIORITY_VERYHIGH
  * @retval None
  */
__STATIC_INLINE void LL_MDMA_SetChannelPriorityLevel(MDMA_TypeDef *MDMAx, uint32_t Channel, uint32_t Priority)
{
  uint32_t mdma_base_addr = (uint32_t)MDMAx;

  MODIFY_REG(((MDMA_Channel_TypeDef *)(mdma_base_addr + LL_MDMA_CH_OFFSET_TAB[Channel]))->CCR, MDMA_CCR_PL, Priority);
}

/**
  * @brief Get Channel priority level.
  * @rmtoll CCR          PL            LL_MDMA_GetChannelPriorityLevel
  * @param  MDMAx MDMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_CHANNEL_0
  *         @arg @ref LL_MDMA_CHANNEL_1
  *         @arg @ref LL_MDMA_CHANNEL_2
  *         @arg @ref LL_MDMA_CHANNEL_3
  *         @arg @ref LL_MDMA_CHANNEL_4
  *         @arg @ref LL_MDMA_CHANNEL_5
  *         @arg @ref LL_MDMA_CHANNEL_6
  *         @arg @ref LL_MDMA_CHANNEL_7
  *         @arg @ref LL_MDMA_CHANNEL_8
  *         @arg @ref LL_MDMA_CHANNEL_9
  *         @arg @ref LL_MDMA_CHANNEL_10
  *         @arg @ref LL_MDMA_CHANNEL_11
  *         @arg @ref LL_MDMA_CHANNEL_12
  *         @arg @ref LL_MDMA_CHANNEL_13
  *         @arg @ref LL_MDMA_CHANNEL_14
  *         @arg @ref LL_MDMA_CHANNEL_15
  *         @arg @ref LL_MDMA_CHANNEL_16
  *         @arg @ref LL_MDMA_CHANNEL_17
  *         @arg @ref LL_MDMA_CHANNEL_18
  *         @arg @ref LL_MDMA_CHANNEL_19
  *         @arg @ref LL_MDMA_CHANNEL_20
  *         @arg @ref LL_MDMA_CHANNEL_21
  *         @arg @ref LL_MDMA_CHANNEL_22
  *         @arg @ref LL_MDMA_CHANNEL_23
  *         @arg @ref LL_MDMA_CHANNEL_24
  *         @arg @ref LL_MDMA_CHANNEL_25
  *         @arg @ref LL_MDMA_CHANNEL_26
  *         @arg @ref LL_MDMA_CHANNEL_27
  *         @arg @ref LL_MDMA_CHANNEL_28
  *         @arg @ref LL_MDMA_CHANNEL_29
  *         @arg @ref LL_MDMA_CHANNEL_30
  *         @arg @ref LL_MDMA_CHANNEL_31
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_MDMA_PRIORITY_LOW
  *         @arg @ref LL_MDMA_PRIORITY_MEDIUM
  *         @arg @ref LL_MDMA_PRIORITY_HIGH
  *         @arg @ref LL_MDMA_PRIORITY_VERYHIGH
  * @retval None
  */
__STATIC_INLINE uint32_t LL_MDMA_GetChannelPriorityLevel(MDMA_TypeDef *MDMAx, uint32_t Channel)
{
  uint32_t mdma_base_addr = (uint32_t)MDMAx;

