zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_mdma.h
  MODIFY_REG(((MDMA_Channel_TypeDef *)(mdma_base_addr + LL_MDMA_CH_OFFSET_TAB[Channel]))->CBRUR, MDMA_CBRUR_DUV,
             ((DestAdrUpdateValue << MDMA_CBRUR_DUV_Pos) & MDMA_CBRUR_DUV_Msk));
}

/**
  * @brief Get transfer Destination address Update Value.
  * @rmtoll CBRUR          DUV            LL_MDMA_GetBlkRptDestAddrUpdateValue
  * @param  MDMAx MDMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_CHANNEL_0
  *         @arg @ref LL_MDMA_CHANNEL_1
  *         @arg @ref LL_MDMA_CHANNEL_2
  *         @arg @ref LL_MDMA_CHANNEL_3
  *         @arg @ref LL_MDMA_CHANNEL_4
  *         @arg @ref LL_MDMA_CHANNEL_5
  *         @arg @ref LL_MDMA_CHANNEL_6
  *         @arg @ref LL_MDMA_CHANNEL_7
  *         @arg @ref LL_MDMA_CHANNEL_8
  *         @arg @ref LL_MDMA_CHANNEL_9
  *         @arg @ref LL_MDMA_CHANNEL_10
  *         @arg @ref LL_MDMA_CHANNEL_11
  *         @arg @ref LL_MDMA_CHANNEL_12
  *         @arg @ref LL_MDMA_CHANNEL_13
  *         @arg @ref LL_MDMA_CHANNEL_14
  *         @arg @ref LL_MDMA_CHANNEL_15
  *         @arg @ref LL_MDMA_CHANNEL_16
  *         @arg @ref LL_MDMA_CHANNEL_17
  *         @arg @ref LL_MDMA_CHANNEL_18
  *         @arg @ref LL_MDMA_CHANNEL_19
  *         @arg @ref LL_MDMA_CHANNEL_20
  *         @arg @ref LL_MDMA_CHANNEL_21
  *         @arg @ref LL_MDMA_CHANNEL_22
  *         @arg @ref LL_MDMA_CHANNEL_23
  *         @arg @ref LL_MDMA_CHANNEL_24
  *         @arg @ref LL_MDMA_CHANNEL_25
  *         @arg @ref LL_MDMA_CHANNEL_26
  *         @arg @ref LL_MDMA_CHANNEL_27
  *         @arg @ref LL_MDMA_CHANNEL_28
  *         @arg @ref LL_MDMA_CHANNEL_29
  *         @arg @ref LL_MDMA_CHANNEL_30
  *         @arg @ref LL_MDMA_CHANNEL_31
  * @retval Between 0 to 0x0000FFFF
  * @retval None
  */
__STATIC_INLINE uint32_t LL_MDMA_GetBlkRptDestAddrUpdateValue(MDMA_TypeDef *MDMAx, uint32_t Channel)
{
  uint32_t mdma_base_addr = (uint32_t)MDMAx;

  return (READ_BIT(((MDMA_Channel_TypeDef *)(mdma_base_addr + LL_MDMA_CH_OFFSET_TAB[Channel]))->CBRUR,
                   MDMA_CBRUR_DUV) >> MDMA_CBRUR_DUV_Pos);
}

/**
  * @brief Set transfer Source address Update Value.
  * @rmtoll CBRUR          SUV            LL_MDMA_SetBlkRptSrcAddrUpdateValue
  * @param  MDMAx MDMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_CHANNEL_0
  *         @arg @ref LL_MDMA_CHANNEL_1
  *         @arg @ref LL_MDMA_CHANNEL_2
  *         @arg @ref LL_MDMA_CHANNEL_3
  *         @arg @ref LL_MDMA_CHANNEL_4
  *         @arg @ref LL_MDMA_CHANNEL_5
  *         @arg @ref LL_MDMA_CHANNEL_6
  *         @arg @ref LL_MDMA_CHANNEL_7
  *         @arg @ref LL_MDMA_CHANNEL_8
  *         @arg @ref LL_MDMA_CHANNEL_9
  *         @arg @ref LL_MDMA_CHANNEL_10
  *         @arg @ref LL_MDMA_CHANNEL_11
  *         @arg @ref LL_MDMA_CHANNEL_12
  *         @arg @ref LL_MDMA_CHANNEL_13
  *         @arg @ref LL_MDMA_CHANNEL_14
  *         @arg @ref LL_MDMA_CHANNEL_15
  *         @arg @ref LL_MDMA_CHANNEL_16
  *         @arg @ref LL_MDMA_CHANNEL_17
  *         @arg @ref LL_MDMA_CHANNEL_18
  *         @arg @ref LL_MDMA_CHANNEL_19
  *         @arg @ref LL_MDMA_CHANNEL_20
  *         @arg @ref LL_MDMA_CHANNEL_21
  *         @arg @ref LL_MDMA_CHANNEL_22
  *         @arg @ref LL_MDMA_CHANNEL_23
  *         @arg @ref LL_MDMA_CHANNEL_24
  *         @arg @ref LL_MDMA_CHANNEL_25
  *         @arg @ref LL_MDMA_CHANNEL_26
  *         @arg @ref LL_MDMA_CHANNEL_27
  *         @arg @ref LL_MDMA_CHANNEL_28
  *         @arg @ref LL_MDMA_CHANNEL_29
  *         @arg @ref LL_MDMA_CHANNEL_30
  *         @arg @ref LL_MDMA_CHANNEL_31
  * @param  SrcAdrUpdateValue Between 0 to 0x0000FFFF
  * @retval None
  */
__STATIC_INLINE void LL_MDMA_SetBlkRptSrcAddrUpdateValue(MDMA_TypeDef *MDMAx, uint32_t Channel,
                                                         uint32_t SrcAdrUpdateValue)
{
  uint32_t mdma_base_addr = (uint32_t)MDMAx;

  MODIFY_REG(((MDMA_Channel_TypeDef *)(mdma_base_addr + LL_MDMA_CH_OFFSET_TAB[Channel]))->CBRUR, MDMA_CBRUR_SUV,
             SrcAdrUpdateValue);
}

/**
  * @brief Get transfer Source address Update Value.
  * @rmtoll CBRUR          SUV            LL_MDMA_GetBlkRptSrcAddrUpdateValue
  * @param  MDMAx MDMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_CHANNEL_0
  *         @arg @ref LL_MDMA_CHANNEL_1
  *         @arg @ref LL_MDMA_CHANNEL_2
  *         @arg @ref LL_MDMA_CHANNEL_3
  *         @arg @ref LL_MDMA_CHANNEL_4
  *         @arg @ref LL_MDMA_CHANNEL_5
  *         @arg @ref LL_MDMA_CHANNEL_6
  *         @arg @ref LL_MDMA_CHANNEL_7
  *         @arg @ref LL_MDMA_CHANNEL_8
  *         @arg @ref LL_MDMA_CHANNEL_9
  *         @arg @ref LL_MDMA_CHANNEL_10
  *         @arg @ref LL_MDMA_CHANNEL_11
  *         @arg @ref LL_MDMA_CHANNEL_12
  *         @arg @ref LL_MDMA_CHANNEL_13
  *         @arg @ref LL_MDMA_CHANNEL_14
  *         @arg @ref LL_MDMA_CHANNEL_15
  *         @arg @ref LL_MDMA_CHANNEL_16
  *         @arg @ref LL_MDMA_CHANNEL_17
  *         @arg @ref LL_MDMA_CHANNEL_18
  *         @arg @ref LL_MDMA_CHANNEL_19
  *         @arg @ref LL_MDMA_CHANNEL_20
  *         @arg @ref LL_MDMA_CHANNEL_21
  *         @arg @ref LL_MDMA_CHANNEL_22
  *         @arg @ref LL_MDMA_CHANNEL_23
  *         @arg @ref LL_MDMA_CHANNEL_24
  *         @arg @ref LL_MDMA_CHANNEL_25
  *         @arg @ref LL_MDMA_CHANNEL_26
  *         @arg @ref LL_MDMA_CHANNEL_27
  *         @arg @ref LL_MDMA_CHANNEL_28
  *         @arg @ref LL_MDMA_CHANNEL_29
  *         @arg @ref LL_MDMA_CHANNEL_30
  *         @arg @ref LL_MDMA_CHANNEL_31
  * @retval Between 0 to 0x0000FFFF
  * @retval None
  */
__STATIC_INLINE uint32_t LL_MDMA_GetBlkRptSrcAddrUpdateValue(MDMA_TypeDef *MDMAx, uint32_t Channel)
{
  uint32_t mdma_base_addr = (uint32_t)MDMAx;

  return (READ_BIT(((MDMA_Channel_TypeDef *)(mdma_base_addr + LL_MDMA_CH_OFFSET_TAB[Channel]))->CBRUR, MDMA_CBRUR_SUV));
}

/**
  * @brief Set transfer Link Address.
  * @rmtoll CLAR          LAR            LL_MDMA_SetLinkAddress
  * @param  MDMAx MDMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_CHANNEL_0
  *         @arg @ref LL_MDMA_CHANNEL_1
  *         @arg @ref LL_MDMA_CHANNEL_2
  *         @arg @ref LL_MDMA_CHANNEL_3
  *         @arg @ref LL_MDMA_CHANNEL_4
  *         @arg @ref LL_MDMA_CHANNEL_5
  *         @arg @ref LL_MDMA_CHANNEL_6
  *         @arg @ref LL_MDMA_CHANNEL_7
  *         @arg @ref LL_MDMA_CHANNEL_8
  *         @arg @ref LL_MDMA_CHANNEL_9
  *         @arg @ref LL_MDMA_CHANNEL_10
  *         @arg @ref LL_MDMA_CHANNEL_11
  *         @arg @ref LL_MDMA_CHANNEL_12
  *         @arg @ref LL_MDMA_CHANNEL_13
  *         @arg @ref LL_MDMA_CHANNEL_14
  *         @arg @ref LL_MDMA_CHANNEL_15
  *         @arg @ref LL_MDMA_CHANNEL_16
  *         @arg @ref LL_MDMA_CHANNEL_17
  *         @arg @ref LL_MDMA_CHANNEL_18
  *         @arg @ref LL_MDMA_CHANNEL_19
  *         @arg @ref LL_MDMA_CHANNEL_20
  *         @arg @ref LL_MDMA_CHANNEL_21
  *         @arg @ref LL_MDMA_CHANNEL_22
  *         @arg @ref LL_MDMA_CHANNEL_23
  *         @arg @ref LL_MDMA_CHANNEL_24
  *         @arg @ref LL_MDMA_CHANNEL_25
  *         @arg @ref LL_MDMA_CHANNEL_26
  *         @arg @ref LL_MDMA_CHANNEL_27
  *         @arg @ref LL_MDMA_CHANNEL_28
  *         @arg @ref LL_MDMA_CHANNEL_29
  *         @arg @ref LL_MDMA_CHANNEL_30
  *         @arg @ref LL_MDMA_CHANNEL_31
  * @param  LinkAddress Between 0 to 0xFFFFFFFF
  * @retval None
  */
__STATIC_INLINE void LL_MDMA_SetLinkAddress(MDMA_TypeDef *MDMAx, uint32_t Channel, uint32_t LinkAddress)
{
  uint32_t mdma_base_addr = (uint32_t)MDMAx;

