zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_mdma.h
  return ((READ_BIT(((MDMA_Channel_TypeDef *)(mdma_base_addr + LL_MDMA_CH_OFFSET_TAB[Channel]))->CESR,
                    MDMA_CESR_TEMD) == (MDMA_CESR_TEMD)) ? 1UL : 0UL);
}

/**
  * @brief Get MDMA Channel x Transfer Error Link Data flag.
  * @rmtoll CESR  TELD    LL_MDMA_IsActiveFlag_TELD
  * @param  MDMAx MDMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_CHANNEL_0
  *         @arg @ref LL_MDMA_CHANNEL_1
  *         @arg @ref LL_MDMA_CHANNEL_2
  *         @arg @ref LL_MDMA_CHANNEL_3
  *         @arg @ref LL_MDMA_CHANNEL_4
  *         @arg @ref LL_MDMA_CHANNEL_5
  *         @arg @ref LL_MDMA_CHANNEL_6
  *         @arg @ref LL_MDMA_CHANNEL_7
  *         @arg @ref LL_MDMA_CHANNEL_8
  *         @arg @ref LL_MDMA_CHANNEL_9
  *         @arg @ref LL_MDMA_CHANNEL_10
  *         @arg @ref LL_MDMA_CHANNEL_11
  *         @arg @ref LL_MDMA_CHANNEL_12
  *         @arg @ref LL_MDMA_CHANNEL_13
  *         @arg @ref LL_MDMA_CHANNEL_14
  *         @arg @ref LL_MDMA_CHANNEL_15
  *         @arg @ref LL_MDMA_CHANNEL_16
  *         @arg @ref LL_MDMA_CHANNEL_17
  *         @arg @ref LL_MDMA_CHANNEL_18
  *         @arg @ref LL_MDMA_CHANNEL_19
  *         @arg @ref LL_MDMA_CHANNEL_20
  *         @arg @ref LL_MDMA_CHANNEL_21
  *         @arg @ref LL_MDMA_CHANNEL_22
  *         @arg @ref LL_MDMA_CHANNEL_23
  *         @arg @ref LL_MDMA_CHANNEL_24
  *         @arg @ref LL_MDMA_CHANNEL_25
  *         @arg @ref LL_MDMA_CHANNEL_26
  *         @arg @ref LL_MDMA_CHANNEL_27
  *         @arg @ref LL_MDMA_CHANNEL_28
  *         @arg @ref LL_MDMA_CHANNEL_29
  *         @arg @ref LL_MDMA_CHANNEL_30
  *         @arg @ref LL_MDMA_CHANNEL_31
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_MDMA_IsActiveFlag_TELD(MDMA_TypeDef *MDMAx, uint32_t Channel)
{
  uint32_t mdma_base_addr = (uint32_t)MDMAx;

  return ((READ_BIT(((MDMA_Channel_TypeDef *)(mdma_base_addr + LL_MDMA_CH_OFFSET_TAB[Channel]))->CESR,
                    MDMA_CESR_TELD) == (MDMA_CESR_TELD)) ? 1UL : 0UL);
}

/**
  * @brief Clear MDMA Channel x Transfer Error interrupt flag.
  * @rmtoll CIFCR  CTEIF    LL_MDMA_ClearFlag_TE
  * @param  MDMAx MDMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_CHANNEL_0
  *         @arg @ref LL_MDMA_CHANNEL_1
  *         @arg @ref LL_MDMA_CHANNEL_2
  *         @arg @ref LL_MDMA_CHANNEL_3
  *         @arg @ref LL_MDMA_CHANNEL_4
  *         @arg @ref LL_MDMA_CHANNEL_5
  *         @arg @ref LL_MDMA_CHANNEL_6
  *         @arg @ref LL_MDMA_CHANNEL_7
  *         @arg @ref LL_MDMA_CHANNEL_8
  *         @arg @ref LL_MDMA_CHANNEL_9
  *         @arg @ref LL_MDMA_CHANNEL_10
  *         @arg @ref LL_MDMA_CHANNEL_11
  *         @arg @ref LL_MDMA_CHANNEL_12
  *         @arg @ref LL_MDMA_CHANNEL_13
  *         @arg @ref LL_MDMA_CHANNEL_14
  *         @arg @ref LL_MDMA_CHANNEL_15
  *         @arg @ref LL_MDMA_CHANNEL_16
  *         @arg @ref LL_MDMA_CHANNEL_17
  *         @arg @ref LL_MDMA_CHANNEL_18
  *         @arg @ref LL_MDMA_CHANNEL_19
  *         @arg @ref LL_MDMA_CHANNEL_20
  *         @arg @ref LL_MDMA_CHANNEL_21
  *         @arg @ref LL_MDMA_CHANNEL_22
  *         @arg @ref LL_MDMA_CHANNEL_23
  *         @arg @ref LL_MDMA_CHANNEL_24
  *         @arg @ref LL_MDMA_CHANNEL_25
  *         @arg @ref LL_MDMA_CHANNEL_26
  *         @arg @ref LL_MDMA_CHANNEL_27
  *         @arg @ref LL_MDMA_CHANNEL_28
  *         @arg @ref LL_MDMA_CHANNEL_29
  *         @arg @ref LL_MDMA_CHANNEL_30
  *         @arg @ref LL_MDMA_CHANNEL_31
  * @retval None
  */
__STATIC_INLINE void LL_MDMA_ClearFlag_TE(MDMA_TypeDef *MDMAx, uint32_t Channel)
{
  uint32_t mdma_base_addr = (uint32_t)MDMAx;

  WRITE_REG(((MDMA_Channel_TypeDef *)(mdma_base_addr + LL_MDMA_CH_OFFSET_TAB[Channel]))->CIFCR, MDMA_CIFCR_CTEIF);
}

/**
  * @brief Clear MDMA Channel x Channel Transfer Complete interrupt flag.
  * @rmtoll CIFCR  CCTCIF    LL_MDMA_ClearFlag_CTC
  * @param  MDMAx MDMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_CHANNEL_0
  *         @arg @ref LL_MDMA_CHANNEL_1
  *         @arg @ref LL_MDMA_CHANNEL_2
  *         @arg @ref LL_MDMA_CHANNEL_3
  *         @arg @ref LL_MDMA_CHANNEL_4
  *         @arg @ref LL_MDMA_CHANNEL_5
  *         @arg @ref LL_MDMA_CHANNEL_6
  *         @arg @ref LL_MDMA_CHANNEL_7
  *         @arg @ref LL_MDMA_CHANNEL_8
  *         @arg @ref LL_MDMA_CHANNEL_9
  *         @arg @ref LL_MDMA_CHANNEL_10
  *         @arg @ref LL_MDMA_CHANNEL_11
  *         @arg @ref LL_MDMA_CHANNEL_12
  *         @arg @ref LL_MDMA_CHANNEL_13
  *         @arg @ref LL_MDMA_CHANNEL_14
  *         @arg @ref LL_MDMA_CHANNEL_15
  *         @arg @ref LL_MDMA_CHANNEL_16
  *         @arg @ref LL_MDMA_CHANNEL_17
  *         @arg @ref LL_MDMA_CHANNEL_18
  *         @arg @ref LL_MDMA_CHANNEL_19
  *         @arg @ref LL_MDMA_CHANNEL_20
  *         @arg @ref LL_MDMA_CHANNEL_21
  *         @arg @ref LL_MDMA_CHANNEL_22
  *         @arg @ref LL_MDMA_CHANNEL_23
  *         @arg @ref LL_MDMA_CHANNEL_24
  *         @arg @ref LL_MDMA_CHANNEL_25
  *         @arg @ref LL_MDMA_CHANNEL_26
  *         @arg @ref LL_MDMA_CHANNEL_27
  *         @arg @ref LL_MDMA_CHANNEL_28
  *         @arg @ref LL_MDMA_CHANNEL_29
  *         @arg @ref LL_MDMA_CHANNEL_30
  *         @arg @ref LL_MDMA_CHANNEL_31
  * @retval None
  */
__STATIC_INLINE void LL_MDMA_ClearFlag_CTC(MDMA_TypeDef *MDMAx, uint32_t Channel)
{
  uint32_t mdma_base_addr = (uint32_t)MDMAx;

  WRITE_REG(((MDMA_Channel_TypeDef *)(mdma_base_addr + LL_MDMA_CH_OFFSET_TAB[Channel]))->CIFCR, MDMA_CIFCR_CCTCIF);
}

/**
  * @brief Clear MDMA Channel x Block Repeat Transfer complete interrupt flag.
  * @rmtoll CIFCR  CBRTIF    LL_MDMA_ClearFlag_BRT
  * @param  MDMAx MDMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_CHANNEL_0
  *         @arg @ref LL_MDMA_CHANNEL_1
  *         @arg @ref LL_MDMA_CHANNEL_2
  *         @arg @ref LL_MDMA_CHANNEL_3
  *         @arg @ref LL_MDMA_CHANNEL_4
  *         @arg @ref LL_MDMA_CHANNEL_5
  *         @arg @ref LL_MDMA_CHANNEL_6
  *         @arg @ref LL_MDMA_CHANNEL_7
  *         @arg @ref LL_MDMA_CHANNEL_8
  *         @arg @ref LL_MDMA_CHANNEL_9
  *         @arg @ref LL_MDMA_CHANNEL_10
  *         @arg @ref LL_MDMA_CHANNEL_11
  *         @arg @ref LL_MDMA_CHANNEL_12
  *         @arg @ref LL_MDMA_CHANNEL_13
  *         @arg @ref LL_MDMA_CHANNEL_14
  *         @arg @ref LL_MDMA_CHANNEL_15
  *         @arg @ref LL_MDMA_CHANNEL_16
  *         @arg @ref LL_MDMA_CHANNEL_17
  *         @arg @ref LL_MDMA_CHANNEL_18
  *         @arg @ref LL_MDMA_CHANNEL_19
  *         @arg @ref LL_MDMA_CHANNEL_20
  *         @arg @ref LL_MDMA_CHANNEL_21
  *         @arg @ref LL_MDMA_CHANNEL_22
  *         @arg @ref LL_MDMA_CHANNEL_23
  *         @arg @ref LL_MDMA_CHANNEL_24
  *         @arg @ref LL_MDMA_CHANNEL_25
  *         @arg @ref LL_MDMA_CHANNEL_26
  *         @arg @ref LL_MDMA_CHANNEL_27
  *         @arg @ref LL_MDMA_CHANNEL_28
  *         @arg @ref LL_MDMA_CHANNEL_29
  *         @arg @ref LL_MDMA_CHANNEL_30
  *         @arg @ref LL_MDMA_CHANNEL_31
  * @retval None
  */
__STATIC_INLINE void LL_MDMA_ClearFlag_BRT(MDMA_TypeDef *MDMAx, uint32_t Channel)
{
  uint32_t mdma_base_addr = (uint32_t)MDMAx;

  WRITE_REG(((MDMA_Channel_TypeDef *)(mdma_base_addr + LL_MDMA_CH_OFFSET_TAB[Channel]))->CIFCR, MDMA_CIFCR_CBRTIF);
}

/**
  * @brief Clear MDMA Channel x Block Transfer complete interrupt flag.
  * @rmtoll CIFCR  CBTIF    LL_MDMA_ClearFlag_BT
  * @param  MDMAx MDMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_CHANNEL_0
  *         @arg @ref LL_MDMA_CHANNEL_1
  *         @arg @ref LL_MDMA_CHANNEL_2
  *         @arg @ref LL_MDMA_CHANNEL_3
  *         @arg @ref LL_MDMA_CHANNEL_4
  *         @arg @ref LL_MDMA_CHANNEL_5
  *         @arg @ref LL_MDMA_CHANNEL_6
  *         @arg @ref LL_MDMA_CHANNEL_7
  *         @arg @ref LL_MDMA_CHANNEL_8
  *         @arg @ref LL_MDMA_CHANNEL_9
  *         @arg @ref LL_MDMA_CHANNEL_10
  *         @arg @ref LL_MDMA_CHANNEL_11
  *         @arg @ref LL_MDMA_CHANNEL_12
  *         @arg @ref LL_MDMA_CHANNEL_13
  *         @arg @ref LL_MDMA_CHANNEL_14
  *         @arg @ref LL_MDMA_CHANNEL_15
  *         @arg @ref LL_MDMA_CHANNEL_16
  *         @arg @ref LL_MDMA_CHANNEL_17
  *         @arg @ref LL_MDMA_CHANNEL_18
  *         @arg @ref LL_MDMA_CHANNEL_19
  *         @arg @ref LL_MDMA_CHANNEL_20
  *         @arg @ref LL_MDMA_CHANNEL_21
  *         @arg @ref LL_MDMA_CHANNEL_22
  *         @arg @ref LL_MDMA_CHANNEL_23
  *         @arg @ref LL_MDMA_CHANNEL_24
  *         @arg @ref LL_MDMA_CHANNEL_25
  *         @arg @ref LL_MDMA_CHANNEL_26
  *         @arg @ref LL_MDMA_CHANNEL_27
  *         @arg @ref LL_MDMA_CHANNEL_28
  *         @arg @ref LL_MDMA_CHANNEL_29
  *         @arg @ref LL_MDMA_CHANNEL_30
  *         @arg @ref LL_MDMA_CHANNEL_31
  * @retval None
  */
__STATIC_INLINE void LL_MDMA_ClearFlag_BT(MDMA_TypeDef *MDMAx, uint32_t Channel)
{
  uint32_t mdma_base_addr = (uint32_t)MDMAx;

  WRITE_REG(((MDMA_Channel_TypeDef *)(mdma_base_addr + LL_MDMA_CH_OFFSET_TAB[Channel]))->CIFCR, MDMA_CIFCR_CBTIF);
}

/**
  * @brief Clear MDMA Channel x buffer transfer Complete Interrupt Flag.
  * @rmtoll CIFCR  CLTCIF    LL_MDMA_ClearFlag_TC
  * @param  MDMAx MDMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_CHANNEL_0
  *         @arg @ref LL_MDMA_CHANNEL_1
  *         @arg @ref LL_MDMA_CHANNEL_2
  *         @arg @ref LL_MDMA_CHANNEL_3
  *         @arg @ref LL_MDMA_CHANNEL_4
  *         @arg @ref LL_MDMA_CHANNEL_5
  *         @arg @ref LL_MDMA_CHANNEL_6
  *         @arg @ref LL_MDMA_CHANNEL_7
  *         @arg @ref LL_MDMA_CHANNEL_8
  *         @arg @ref LL_MDMA_CHANNEL_9
  *         @arg @ref LL_MDMA_CHANNEL_10
  *         @arg @ref LL_MDMA_CHANNEL_11
  *         @arg @ref LL_MDMA_CHANNEL_12
  *         @arg @ref LL_MDMA_CHANNEL_13
  *         @arg @ref LL_MDMA_CHANNEL_14
  *         @arg @ref LL_MDMA_CHANNEL_15
  *         @arg @ref LL_MDMA_CHANNEL_16
  *         @arg @ref LL_MDMA_CHANNEL_17
  *         @arg @ref LL_MDMA_CHANNEL_18
  *         @arg @ref LL_MDMA_CHANNEL_19
  *         @arg @ref LL_MDMA_CHANNEL_20
  *         @arg @ref LL_MDMA_CHANNEL_21
  *         @arg @ref LL_MDMA_CHANNEL_22
  *         @arg @ref LL_MDMA_CHANNEL_23
  *         @arg @ref LL_MDMA_CHANNEL_24
  *         @arg @ref LL_MDMA_CHANNEL_25
  *         @arg @ref LL_MDMA_CHANNEL_26
  *         @arg @ref LL_MDMA_CHANNEL_27
  *         @arg @ref LL_MDMA_CHANNEL_28
  *         @arg @ref LL_MDMA_CHANNEL_29
  *         @arg @ref LL_MDMA_CHANNEL_30
  *         @arg @ref LL_MDMA_CHANNEL_31
  * @retval None
  */
__STATIC_INLINE void LL_MDMA_ClearFlag_TC(MDMA_TypeDef *MDMAx, uint32_t Channel)
{
  uint32_t mdma_base_addr = (uint32_t)MDMAx;

  WRITE_REG(((MDMA_Channel_TypeDef *)(mdma_base_addr + LL_MDMA_CH_OFFSET_TAB[Channel]))->CIFCR, MDMA_CIFCR_CLTCIF);
}

/**
  * @}
  */

