zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_mdma.h
/** @defgroup MDMA_LL_EF_IT_Management IT_Management
  * @{
  */

/**
  * @brief Enable MDMA Channel x Transfer Error interrupt.
  * @rmtoll CCR  TEIE    LL_MDMA_EnableIT_TE
  * @param  MDMAx MDMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_CHANNEL_0
  *         @arg @ref LL_MDMA_CHANNEL_1
  *         @arg @ref LL_MDMA_CHANNEL_2
  *         @arg @ref LL_MDMA_CHANNEL_3
  *         @arg @ref LL_MDMA_CHANNEL_4
  *         @arg @ref LL_MDMA_CHANNEL_5
  *         @arg @ref LL_MDMA_CHANNEL_6
  *         @arg @ref LL_MDMA_CHANNEL_7
  *         @arg @ref LL_MDMA_CHANNEL_8
  *         @arg @ref LL_MDMA_CHANNEL_9
  *         @arg @ref LL_MDMA_CHANNEL_10
  *         @arg @ref LL_MDMA_CHANNEL_11
  *         @arg @ref LL_MDMA_CHANNEL_12
  *         @arg @ref LL_MDMA_CHANNEL_13
  *         @arg @ref LL_MDMA_CHANNEL_14
  *         @arg @ref LL_MDMA_CHANNEL_15
  *         @arg @ref LL_MDMA_CHANNEL_16
  *         @arg @ref LL_MDMA_CHANNEL_17
  *         @arg @ref LL_MDMA_CHANNEL_18
  *         @arg @ref LL_MDMA_CHANNEL_19
  *         @arg @ref LL_MDMA_CHANNEL_20
  *         @arg @ref LL_MDMA_CHANNEL_21
  *         @arg @ref LL_MDMA_CHANNEL_22
  *         @arg @ref LL_MDMA_CHANNEL_23
  *         @arg @ref LL_MDMA_CHANNEL_24
  *         @arg @ref LL_MDMA_CHANNEL_25
  *         @arg @ref LL_MDMA_CHANNEL_26
  *         @arg @ref LL_MDMA_CHANNEL_27
  *         @arg @ref LL_MDMA_CHANNEL_28
  *         @arg @ref LL_MDMA_CHANNEL_29
  *         @arg @ref LL_MDMA_CHANNEL_30
  *         @arg @ref LL_MDMA_CHANNEL_31
  * @retval None
  */
__STATIC_INLINE void LL_MDMA_EnableIT_TE(MDMA_TypeDef *MDMAx, uint32_t Channel)
{
  uint32_t mdma_base_addr = (uint32_t)MDMAx;

  SET_BIT(((MDMA_Channel_TypeDef *)(mdma_base_addr + LL_MDMA_CH_OFFSET_TAB[Channel]))->CCR, MDMA_CCR_TEIE);
}

/**
  * @brief Enable MDMA Channel x Channel Transfer Complete interrupt.
  * @rmtoll CCR  CTCIE    LL_MDMA_EnableIT_CTC
  * @param  MDMAx MDMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_CHANNEL_0
  *         @arg @ref LL_MDMA_CHANNEL_1
  *         @arg @ref LL_MDMA_CHANNEL_2
  *         @arg @ref LL_MDMA_CHANNEL_3
  *         @arg @ref LL_MDMA_CHANNEL_4
  *         @arg @ref LL_MDMA_CHANNEL_5
  *         @arg @ref LL_MDMA_CHANNEL_6
  *         @arg @ref LL_MDMA_CHANNEL_7
  *         @arg @ref LL_MDMA_CHANNEL_8
  *         @arg @ref LL_MDMA_CHANNEL_9
  *         @arg @ref LL_MDMA_CHANNEL_10
  *         @arg @ref LL_MDMA_CHANNEL_11
  *         @arg @ref LL_MDMA_CHANNEL_12
  *         @arg @ref LL_MDMA_CHANNEL_13
  *         @arg @ref LL_MDMA_CHANNEL_14
  *         @arg @ref LL_MDMA_CHANNEL_15
  *         @arg @ref LL_MDMA_CHANNEL_16
  *         @arg @ref LL_MDMA_CHANNEL_17
  *         @arg @ref LL_MDMA_CHANNEL_18
  *         @arg @ref LL_MDMA_CHANNEL_19
  *         @arg @ref LL_MDMA_CHANNEL_20
  *         @arg @ref LL_MDMA_CHANNEL_21
  *         @arg @ref LL_MDMA_CHANNEL_22
  *         @arg @ref LL_MDMA_CHANNEL_23
  *         @arg @ref LL_MDMA_CHANNEL_24
  *         @arg @ref LL_MDMA_CHANNEL_25
  *         @arg @ref LL_MDMA_CHANNEL_26
  *         @arg @ref LL_MDMA_CHANNEL_27
  *         @arg @ref LL_MDMA_CHANNEL_28
  *         @arg @ref LL_MDMA_CHANNEL_29
  *         @arg @ref LL_MDMA_CHANNEL_30
  *         @arg @ref LL_MDMA_CHANNEL_31
  * @retval None
  */
__STATIC_INLINE void LL_MDMA_EnableIT_CTC(MDMA_TypeDef *MDMAx, uint32_t Channel)
{
  uint32_t mdma_base_addr = (uint32_t)MDMAx;

  SET_BIT(((MDMA_Channel_TypeDef *)(mdma_base_addr + LL_MDMA_CH_OFFSET_TAB[Channel]))->CCR, MDMA_CCR_CTCIE);
}

/**
  * @brief Enable MDMA Channel x Block Repeat Transfer interrupt.
  * @rmtoll CCR  BRTIE    LL_MDMA_EnableIT_BRT
  * @param  MDMAx MDMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_CHANNEL_0
  *         @arg @ref LL_MDMA_CHANNEL_1
  *         @arg @ref LL_MDMA_CHANNEL_2
  *         @arg @ref LL_MDMA_CHANNEL_3
  *         @arg @ref LL_MDMA_CHANNEL_4
  *         @arg @ref LL_MDMA_CHANNEL_5
  *         @arg @ref LL_MDMA_CHANNEL_6
  *         @arg @ref LL_MDMA_CHANNEL_7
  *         @arg @ref LL_MDMA_CHANNEL_8
  *         @arg @ref LL_MDMA_CHANNEL_9
  *         @arg @ref LL_MDMA_CHANNEL_10
  *         @arg @ref LL_MDMA_CHANNEL_11
  *         @arg @ref LL_MDMA_CHANNEL_12
  *         @arg @ref LL_MDMA_CHANNEL_13
  *         @arg @ref LL_MDMA_CHANNEL_14
  *         @arg @ref LL_MDMA_CHANNEL_15
  *         @arg @ref LL_MDMA_CHANNEL_16
  *         @arg @ref LL_MDMA_CHANNEL_17
  *         @arg @ref LL_MDMA_CHANNEL_18
  *         @arg @ref LL_MDMA_CHANNEL_19
  *         @arg @ref LL_MDMA_CHANNEL_20
  *         @arg @ref LL_MDMA_CHANNEL_21
  *         @arg @ref LL_MDMA_CHANNEL_22
  *         @arg @ref LL_MDMA_CHANNEL_23
  *         @arg @ref LL_MDMA_CHANNEL_24
  *         @arg @ref LL_MDMA_CHANNEL_25
  *         @arg @ref LL_MDMA_CHANNEL_26
  *         @arg @ref LL_MDMA_CHANNEL_27
  *         @arg @ref LL_MDMA_CHANNEL_28
  *         @arg @ref LL_MDMA_CHANNEL_29
  *         @arg @ref LL_MDMA_CHANNEL_30
  *         @arg @ref LL_MDMA_CHANNEL_31
  * @retval None
  */
__STATIC_INLINE void LL_MDMA_EnableIT_BRT(MDMA_TypeDef *MDMAx, uint32_t Channel)
{
  uint32_t mdma_base_addr = (uint32_t)MDMAx;

  SET_BIT(((MDMA_Channel_TypeDef *)(mdma_base_addr + LL_MDMA_CH_OFFSET_TAB[Channel]))->CCR, MDMA_CCR_BRTIE);
}

/**
  * @brief Enable MDMA Channel x Block Transfer interrupt.
  * @rmtoll CCR  BTIE    LL_MDMA_EnableIT_BT
  * @param  MDMAx MDMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_CHANNEL_0
  *         @arg @ref LL_MDMA_CHANNEL_1
  *         @arg @ref LL_MDMA_CHANNEL_2
  *         @arg @ref LL_MDMA_CHANNEL_3
  *         @arg @ref LL_MDMA_CHANNEL_4
  *         @arg @ref LL_MDMA_CHANNEL_5
  *         @arg @ref LL_MDMA_CHANNEL_6
  *         @arg @ref LL_MDMA_CHANNEL_7
  *         @arg @ref LL_MDMA_CHANNEL_8
  *         @arg @ref LL_MDMA_CHANNEL_9
  *         @arg @ref LL_MDMA_CHANNEL_10
  *         @arg @ref LL_MDMA_CHANNEL_11
  *         @arg @ref LL_MDMA_CHANNEL_12
  *         @arg @ref LL_MDMA_CHANNEL_13
  *         @arg @ref LL_MDMA_CHANNEL_14
  *         @arg @ref LL_MDMA_CHANNEL_15
  *         @arg @ref LL_MDMA_CHANNEL_16
  *         @arg @ref LL_MDMA_CHANNEL_17
  *         @arg @ref LL_MDMA_CHANNEL_18
  *         @arg @ref LL_MDMA_CHANNEL_19
  *         @arg @ref LL_MDMA_CHANNEL_20
  *         @arg @ref LL_MDMA_CHANNEL_21
  *         @arg @ref LL_MDMA_CHANNEL_22
  *         @arg @ref LL_MDMA_CHANNEL_23
  *         @arg @ref LL_MDMA_CHANNEL_24
  *         @arg @ref LL_MDMA_CHANNEL_25
  *         @arg @ref LL_MDMA_CHANNEL_26
  *         @arg @ref LL_MDMA_CHANNEL_27
  *         @arg @ref LL_MDMA_CHANNEL_28
  *         @arg @ref LL_MDMA_CHANNEL_29
  *         @arg @ref LL_MDMA_CHANNEL_30
  *         @arg @ref LL_MDMA_CHANNEL_31
  * @retval None
  */
__STATIC_INLINE void LL_MDMA_EnableIT_BT(MDMA_TypeDef *MDMAx, uint32_t Channel)
{
  uint32_t mdma_base_addr = (uint32_t)MDMAx;

  SET_BIT(((MDMA_Channel_TypeDef *)(mdma_base_addr + LL_MDMA_CH_OFFSET_TAB[Channel]))->CCR, MDMA_CCR_BTIE);
}

/**
  * @brief Enable MDMA Channel x buffer transfer complete interrupt.
  * @rmtoll CCR  TCIE    LL_MDMA_EnableIT_TC
  * @param  MDMAx MDMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_CHANNEL_0
  *         @arg @ref LL_MDMA_CHANNEL_1
  *         @arg @ref LL_MDMA_CHANNEL_2
  *         @arg @ref LL_MDMA_CHANNEL_3
  *         @arg @ref LL_MDMA_CHANNEL_4
  *         @arg @ref LL_MDMA_CHANNEL_5
  *         @arg @ref LL_MDMA_CHANNEL_6
  *         @arg @ref LL_MDMA_CHANNEL_7
  *         @arg @ref LL_MDMA_CHANNEL_8
  *         @arg @ref LL_MDMA_CHANNEL_9
  *         @arg @ref LL_MDMA_CHANNEL_10
  *         @arg @ref LL_MDMA_CHANNEL_11
  *         @arg @ref LL_MDMA_CHANNEL_12
  *         @arg @ref LL_MDMA_CHANNEL_13
  *         @arg @ref LL_MDMA_CHANNEL_14
  *         @arg @ref LL_MDMA_CHANNEL_15
  *         @arg @ref LL_MDMA_CHANNEL_16
  *         @arg @ref LL_MDMA_CHANNEL_17
  *         @arg @ref LL_MDMA_CHANNEL_18
  *         @arg @ref LL_MDMA_CHANNEL_19
  *         @arg @ref LL_MDMA_CHANNEL_20
  *         @arg @ref LL_MDMA_CHANNEL_21
  *         @arg @ref LL_MDMA_CHANNEL_22
  *         @arg @ref LL_MDMA_CHANNEL_23
  *         @arg @ref LL_MDMA_CHANNEL_24
  *         @arg @ref LL_MDMA_CHANNEL_25
  *         @arg @ref LL_MDMA_CHANNEL_26
  *         @arg @ref LL_MDMA_CHANNEL_27
  *         @arg @ref LL_MDMA_CHANNEL_28
  *         @arg @ref LL_MDMA_CHANNEL_29
  *         @arg @ref LL_MDMA_CHANNEL_30
  *         @arg @ref LL_MDMA_CHANNEL_31
  * @retval None
  */
__STATIC_INLINE void LL_MDMA_EnableIT_TC(MDMA_TypeDef *MDMAx, uint32_t Channel)
{
  uint32_t mdma_base_addr = (uint32_t)MDMAx;

  SET_BIT(((MDMA_Channel_TypeDef *)(mdma_base_addr + LL_MDMA_CH_OFFSET_TAB[Channel]))->CCR, MDMA_CCR_TCIE);
}

/**
  * @brief Disable MDMA Channel x Transfer Error interrupt.
  * @rmtoll CCR  TEIE    LL_MDMA_DisableIT_TE
  * @param  MDMAx MDMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_CHANNEL_0
  *         @arg @ref LL_MDMA_CHANNEL_1
  *         @arg @ref LL_MDMA_CHANNEL_2
  *         @arg @ref LL_MDMA_CHANNEL_3
  *         @arg @ref LL_MDMA_CHANNEL_4
  *         @arg @ref LL_MDMA_CHANNEL_5
  *         @arg @ref LL_MDMA_CHANNEL_6
  *         @arg @ref LL_MDMA_CHANNEL_7
  *         @arg @ref LL_MDMA_CHANNEL_8
  *         @arg @ref LL_MDMA_CHANNEL_9
  *         @arg @ref LL_MDMA_CHANNEL_10
  *         @arg @ref LL_MDMA_CHANNEL_11
  *         @arg @ref LL_MDMA_CHANNEL_12
  *         @arg @ref LL_MDMA_CHANNEL_13
  *         @arg @ref LL_MDMA_CHANNEL_14
  *         @arg @ref LL_MDMA_CHANNEL_15
  *         @arg @ref LL_MDMA_CHANNEL_16
  *         @arg @ref LL_MDMA_CHANNEL_17
  *         @arg @ref LL_MDMA_CHANNEL_18
  *         @arg @ref LL_MDMA_CHANNEL_19
  *         @arg @ref LL_MDMA_CHANNEL_20
  *         @arg @ref LL_MDMA_CHANNEL_21
  *         @arg @ref LL_MDMA_CHANNEL_22
  *         @arg @ref LL_MDMA_CHANNEL_23
  *         @arg @ref LL_MDMA_CHANNEL_24
  *         @arg @ref LL_MDMA_CHANNEL_25
  *         @arg @ref LL_MDMA_CHANNEL_26
  *         @arg @ref LL_MDMA_CHANNEL_27
  *         @arg @ref LL_MDMA_CHANNEL_28
  *         @arg @ref LL_MDMA_CHANNEL_29
  *         @arg @ref LL_MDMA_CHANNEL_30
  *         @arg @ref LL_MDMA_CHANNEL_31
  * @retval None
  */
__STATIC_INLINE void LL_MDMA_DisableIT_TE(MDMA_TypeDef *MDMAx, uint32_t Channel)
{
  uint32_t mdma_base_addr = (uint32_t)MDMAx;

  CLEAR_BIT(((MDMA_Channel_TypeDef *)(mdma_base_addr + LL_MDMA_CH_OFFSET_TAB[Channel]))->CCR, MDMA_CCR_TEIE);
}

/**
  * @brief Disable MDMA Channel x Channel Transfer Complete interrupt.
  * @rmtoll CCR  CTCIE    LL_MDMA_DisableIT_CTC
  * @param  MDMAx MDMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_CHANNEL_0
  *         @arg @ref LL_MDMA_CHANNEL_1
  *         @arg @ref LL_MDMA_CHANNEL_2
  *         @arg @ref LL_MDMA_CHANNEL_3
  *         @arg @ref LL_MDMA_CHANNEL_4
  *         @arg @ref LL_MDMA_CHANNEL_5
  *         @arg @ref LL_MDMA_CHANNEL_6
  *         @arg @ref LL_MDMA_CHANNEL_7
  *         @arg @ref LL_MDMA_CHANNEL_8
  *         @arg @ref LL_MDMA_CHANNEL_9
  *         @arg @ref LL_MDMA_CHANNEL_10
  *         @arg @ref LL_MDMA_CHANNEL_11
  *         @arg @ref LL_MDMA_CHANNEL_12
  *         @arg @ref LL_MDMA_CHANNEL_13
  *         @arg @ref LL_MDMA_CHANNEL_14
  *         @arg @ref LL_MDMA_CHANNEL_15
  *         @arg @ref LL_MDMA_CHANNEL_16
  *         @arg @ref LL_MDMA_CHANNEL_17
  *         @arg @ref LL_MDMA_CHANNEL_18
  *         @arg @ref LL_MDMA_CHANNEL_19
  *         @arg @ref LL_MDMA_CHANNEL_20
  *         @arg @ref LL_MDMA_CHANNEL_21
  *         @arg @ref LL_MDMA_CHANNEL_22
  *         @arg @ref LL_MDMA_CHANNEL_23
  *         @arg @ref LL_MDMA_CHANNEL_24
  *         @arg @ref LL_MDMA_CHANNEL_25
  *         @arg @ref LL_MDMA_CHANNEL_26
  *         @arg @ref LL_MDMA_CHANNEL_27
  *         @arg @ref LL_MDMA_CHANNEL_28
  *         @arg @ref LL_MDMA_CHANNEL_29
  *         @arg @ref LL_MDMA_CHANNEL_30
  *         @arg @ref LL_MDMA_CHANNEL_31
  * @retval None
  */
__STATIC_INLINE void LL_MDMA_DisableIT_CTC(MDMA_TypeDef *MDMAx, uint32_t Channel)
{
  uint32_t mdma_base_addr = (uint32_t)MDMAx;

  CLEAR_BIT(((MDMA_Channel_TypeDef *)(mdma_base_addr + LL_MDMA_CH_OFFSET_TAB[Channel]))->CCR, MDMA_CCR_CTCIE);
}

/**
  * @brief Disable MDMA Channel x Block Repeat Transfer interrupt.
  * @rmtoll CCR  BRTIE    LL_MDMA_DisableIT_BRT
  * @param  MDMAx MDMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_CHANNEL_0
  *         @arg @ref LL_MDMA_CHANNEL_1
  *         @arg @ref LL_MDMA_CHANNEL_2
  *         @arg @ref LL_MDMA_CHANNEL_3
  *         @arg @ref LL_MDMA_CHANNEL_4
  *         @arg @ref LL_MDMA_CHANNEL_5
  *         @arg @ref LL_MDMA_CHANNEL_6
  *         @arg @ref LL_MDMA_CHANNEL_7
  *         @arg @ref LL_MDMA_CHANNEL_8
  *         @arg @ref LL_MDMA_CHANNEL_9
  *         @arg @ref LL_MDMA_CHANNEL_10
  *         @arg @ref LL_MDMA_CHANNEL_11
  *         @arg @ref LL_MDMA_CHANNEL_12
  *         @arg @ref LL_MDMA_CHANNEL_13
  *         @arg @ref LL_MDMA_CHANNEL_14
  *         @arg @ref LL_MDMA_CHANNEL_15
  *         @arg @ref LL_MDMA_CHANNEL_16
  *         @arg @ref LL_MDMA_CHANNEL_17
  *         @arg @ref LL_MDMA_CHANNEL_18
  *         @arg @ref LL_MDMA_CHANNEL_19
  *         @arg @ref LL_MDMA_CHANNEL_20
  *         @arg @ref LL_MDMA_CHANNEL_21
  *         @arg @ref LL_MDMA_CHANNEL_22
  *         @arg @ref LL_MDMA_CHANNEL_23
  *         @arg @ref LL_MDMA_CHANNEL_24
  *         @arg @ref LL_MDMA_CHANNEL_25
  *         @arg @ref LL_MDMA_CHANNEL_26
  *         @arg @ref LL_MDMA_CHANNEL_27
  *         @arg @ref LL_MDMA_CHANNEL_28
  *         @arg @ref LL_MDMA_CHANNEL_29
  *         @arg @ref LL_MDMA_CHANNEL_30
  *         @arg @ref LL_MDMA_CHANNEL_31
  * @retval None
  */
__STATIC_INLINE void LL_MDMA_DisableIT_BRT(MDMA_TypeDef *MDMAx, uint32_t Channel)
{
  uint32_t mdma_base_addr = (uint32_t)MDMAx;

  CLEAR_BIT(((MDMA_Channel_TypeDef *)(mdma_base_addr + LL_MDMA_CH_OFFSET_TAB[Channel]))->CCR, MDMA_CCR_BRTIE);
}

/**
  * @brief Disable MDMA Channel x Block Transfer interrupt.
  * @rmtoll CCR  BTIE    LL_MDMA_DisableIT_BT
  * @param  MDMAx MDMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_CHANNEL_0
  *         @arg @ref LL_MDMA_CHANNEL_1
  *         @arg @ref LL_MDMA_CHANNEL_2
  *         @arg @ref LL_MDMA_CHANNEL_3
  *         @arg @ref LL_MDMA_CHANNEL_4
  *         @arg @ref LL_MDMA_CHANNEL_5
  *         @arg @ref LL_MDMA_CHANNEL_6
  *         @arg @ref LL_MDMA_CHANNEL_7
  *         @arg @ref LL_MDMA_CHANNEL_8
  *         @arg @ref LL_MDMA_CHANNEL_9
  *         @arg @ref LL_MDMA_CHANNEL_10
  *         @arg @ref LL_MDMA_CHANNEL_11
  *         @arg @ref LL_MDMA_CHANNEL_12
  *         @arg @ref LL_MDMA_CHANNEL_13
  *         @arg @ref LL_MDMA_CHANNEL_14
  *         @arg @ref LL_MDMA_CHANNEL_15
  *         @arg @ref LL_MDMA_CHANNEL_16
  *         @arg @ref LL_MDMA_CHANNEL_17
  *         @arg @ref LL_MDMA_CHANNEL_18
  *         @arg @ref LL_MDMA_CHANNEL_19
  *         @arg @ref LL_MDMA_CHANNEL_20
  *         @arg @ref LL_MDMA_CHANNEL_21
  *         @arg @ref LL_MDMA_CHANNEL_22
  *         @arg @ref LL_MDMA_CHANNEL_23
  *         @arg @ref LL_MDMA_CHANNEL_24
  *         @arg @ref LL_MDMA_CHANNEL_25
  *         @arg @ref LL_MDMA_CHANNEL_26
  *         @arg @ref LL_MDMA_CHANNEL_27
  *         @arg @ref LL_MDMA_CHANNEL_28
  *         @arg @ref LL_MDMA_CHANNEL_29
  *         @arg @ref LL_MDMA_CHANNEL_30
  *         @arg @ref LL_MDMA_CHANNEL_31
  * @retval None
  */
__STATIC_INLINE void LL_MDMA_DisableIT_BT(MDMA_TypeDef *MDMAx, uint32_t Channel)
{
  uint32_t mdma_base_addr = (uint32_t)MDMAx;

  CLEAR_BIT(((MDMA_Channel_TypeDef *)(mdma_base_addr + LL_MDMA_CH_OFFSET_TAB[Channel]))->CCR, MDMA_CCR_BTIE);
}

/**
  * @brief Disable MDMA Channel x buffer transfer complete interrupt.
  * @rmtoll CCR  TCIE    LL_MDMA_DisableIT_TC
  * @param  MDMAx MDMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_CHANNEL_0
  *         @arg @ref LL_MDMA_CHANNEL_1
  *         @arg @ref LL_MDMA_CHANNEL_2
  *         @arg @ref LL_MDMA_CHANNEL_3
  *         @arg @ref LL_MDMA_CHANNEL_4
  *         @arg @ref LL_MDMA_CHANNEL_5
  *         @arg @ref LL_MDMA_CHANNEL_6
  *         @arg @ref LL_MDMA_CHANNEL_7
  *         @arg @ref LL_MDMA_CHANNEL_8
  *         @arg @ref LL_MDMA_CHANNEL_9
  *         @arg @ref LL_MDMA_CHANNEL_10
  *         @arg @ref LL_MDMA_CHANNEL_11
  *         @arg @ref LL_MDMA_CHANNEL_12
  *         @arg @ref LL_MDMA_CHANNEL_13
  *         @arg @ref LL_MDMA_CHANNEL_14
  *         @arg @ref LL_MDMA_CHANNEL_15
  *         @arg @ref LL_MDMA_CHANNEL_16
  *         @arg @ref LL_MDMA_CHANNEL_17
  *         @arg @ref LL_MDMA_CHANNEL_18
  *         @arg @ref LL_MDMA_CHANNEL_19
  *         @arg @ref LL_MDMA_CHANNEL_20
  *         @arg @ref LL_MDMA_CHANNEL_21
  *         @arg @ref LL_MDMA_CHANNEL_22
  *         @arg @ref LL_MDMA_CHANNEL_23
  *         @arg @ref LL_MDMA_CHANNEL_24
  *         @arg @ref LL_MDMA_CHANNEL_25
  *         @arg @ref LL_MDMA_CHANNEL_26
  *         @arg @ref LL_MDMA_CHANNEL_27
  *         @arg @ref LL_MDMA_CHANNEL_28
  *         @arg @ref LL_MDMA_CHANNEL_29
  *         @arg @ref LL_MDMA_CHANNEL_30
  *         @arg @ref LL_MDMA_CHANNEL_31
  * @retval None
  */
__STATIC_INLINE void LL_MDMA_DisableIT_TC(MDMA_TypeDef *MDMAx, uint32_t Channel)
{
  uint32_t mdma_base_addr = (uint32_t)MDMAx;

  CLEAR_BIT(((MDMA_Channel_TypeDef *)(mdma_base_addr + LL_MDMA_CH_OFFSET_TAB[Channel]))->CCR, MDMA_CCR_TCIE);
}

/**
  * @brief Check if MDMA Channel x Transfer Error interrupt is enabled.
  * @rmtoll CCR  TEIE    LL_MDMA_IsEnabledIT_TE
  * @param  MDMAx MDMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_MDMA_CHANNEL_0
  *         @arg @ref LL_MDMA_CHANNEL_1
  *         @arg @ref LL_MDMA_CHANNEL_2
  *         @arg @ref LL_MDMA_CHANNEL_3
  *         @arg @ref LL_MDMA_CHANNEL_4
  *         @arg @ref LL_MDMA_CHANNEL_5
  *         @arg @ref LL_MDMA_CHANNEL_6
  *         @arg @ref LL_MDMA_CHANNEL_7
  *         @arg @ref LL_MDMA_CHANNEL_8
  *         @arg @ref LL_MDMA_CHANNEL_9
  *         @arg @ref LL_MDMA_CHANNEL_10
  *         @arg @ref LL_MDMA_CHANNEL_11
  *         @arg @ref LL_MDMA_CHANNEL_12
  *         @arg @ref LL_MDMA_CHANNEL_13
  *         @arg @ref LL_MDMA_CHANNEL_14
  *         @arg @ref LL_MDMA_CHANNEL_15
  *         @arg @ref LL_MDMA_CHANNEL_16
  *         @arg @ref LL_MDMA_CHANNEL_17
  *         @arg @ref LL_MDMA_CHANNEL_18
  *         @arg @ref LL_MDMA_CHANNEL_19
  *         @arg @ref LL_MDMA_CHANNEL_20
  *         @arg @ref LL_MDMA_CHANNEL_21
  *         @arg @ref LL_MDMA_CHANNEL_22
  *         @arg @ref LL_MDMA_CHANNEL_23
  *         @arg @ref LL_MDMA_CHANNEL_24
  *         @arg @ref LL_MDMA_CHANNEL_25
  *         @arg @ref LL_MDMA_CHANNEL_26
  *         @arg @ref LL_MDMA_CHANNEL_27
  *         @arg @ref LL_MDMA_CHANNEL_28
  *         @arg @ref LL_MDMA_CHANNEL_29
  *         @arg @ref LL_MDMA_CHANNEL_30
  *         @arg @ref LL_MDMA_CHANNEL_31
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_MDMA_IsEnabledIT_TE(MDMA_TypeDef *MDMAx, uint32_t Channel)
{
  uint32_t mdma_base_addr = (uint32_t)MDMAx;

